{
  "chapter": "1",
  "chapter_name": "Forsaken_City",
  "side": "A",
  "sources": [
    {
      "source_id": 1,
      "url": "https://celeste.ink/wiki/Forsaken_City",
      "content_length": 14454
    },
    {
      "source_id": 2,
      "url": "https://celestegame.fandom.com/wiki/Chapter_1:_Forsaken_City",
      "content_length": 19105
    },
    {
      "source_id": 3,
      "url": "https://www.ign.com/wikis/celeste/Chapter_1-_Forsaken_City",
      "content_length": 10682
    },
    {
      "source_id": 4,
      "url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
      "content_length": 18783
    },
    {
      "source_id": 5,
      "url": "https://celestegame.fandom.com/wiki/Chapter_1:_Forsaken_City",
      "content_length": 19105
    },
    {
      "source_id": 6,
      "url": "https://www.neoseeker.com/celeste/walkthrough/Level_1_-_Forsaken_City",
      "content_length": 22521
    },
    {
      "source_id": 7,
      "url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
      "content_length": 23705
    },
    {
      "source_id": 8,
      "url": "https://www.trueachievements.com/game/Celeste/walkthrough/3",
      "content_length": 13882
    }
  ],
  "strawberries": {
    "5": [
      {
        "source_id": 3,
        "source_url": "https://www.ign.com/wikis/celeste/Chapter_1-_Forsaken_City",
        "content": "left with the glowing light first. Jump and dash upward to make it to the landing in the middle. You can grab the wall if you need to climb up. Using the spring, hop over the spikes and fall gracefully downward, using your dash to collect the strawberry and land safely.\n\n### Strawberry \\#5\n\nThe screen above the flying strawberry, use the lift on the right to fling yourself up and to the left. Use your dash to grab the strawberry in the upper left corner.\n\n### Strawberry \\#6\n\nIn the same room as Strawberry #5 is a breakable block in the lower right corner. Dash through it to find the sixth strawberry’s location. Drop through the spikes and dash to the geared platform. Ride it and jump off toward the strawberry. Catch a ride back and dash through the floor above to safely clear the room.\n\n## Crossing\n\n### Strawberry \\#7\n\nThis strawberry is in a room above the character Theo. To find Theo, go left from the room with a green crystal in the center. Jump and dash diagonally to the left to hit the green c"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ \n \n \n \n \n Chapter Overview \n \n ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Crystal Heart Checkpoint 1 ‎Crossing‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎‎ Strawberries [x20] Missable 4, 6, 7, 8, 9, 10, 11, 12, 13, 16, 17, 19, 20 Not Missable* 1, 2, 3, 5, 14, 15, 18 ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this guide someti"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "grab the strawberry, dashing upwards to land back on the platform and collect it. \n \n \n \n \n Strawberry 4 \n \n [Missable] In the room above the flying strawberry, head left towards the glow to find strawberry 4. Once inside the strawberry room: Head towards the platform in the middle of the screen covered in snow, dashing up onto the spring pad over the spikes, then dashing right to collect the strawberry. To exit and continue Exit the strawberry room the way you entered - to the right. \n \n \n \n \n Strawberry 5 \n \n [Not Missable] In the room above the flying strawberry you'll find strawberry 5. Use the traffic light lift to boost yourself up and grab onto the floating ice with spikes, jumping to dash onto the platform and collect the strawberry. \n \n \n \n \n Strawberry 6 \n \n [Missable] In the room above the flying strawberry, head to the bottom right of the room and you will see breakable ice - dash into the ice to break it, then enter the room to find strawberry 6. Once inside, jump down avoiding the sp"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "Strawberry 4 \n \n [Missable] In the room above the flying strawberry, head left towards the glow to find strawberry 4. Once inside the strawberry room: Head towards the platform in the middle of the screen covered in snow, dashing up onto the spring pad over the spikes, then dashing right to collect the strawberry. To exit and continue Exit the strawberry room the way you entered - to the right. \n \n \n \n \n Strawberry 5 \n \n [Not Missable] In the room above the flying strawberry you'll find strawberry 5. Use the traffic light lift to boost yourself up and grab onto the floating ice with spikes, jumping to dash onto the platform and collect the strawberry. \n \n \n \n \n Strawberry 6 \n \n [Missable] In the room above the flying strawberry, head to the bottom right of the room and you will see breakable ice - dash into the ice to break it, then enter the room to find strawberry 6. Once inside, jump down avoiding the spikes - then dash up-right onto the traffic light lift and ride it to collect the str"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "nd then kick off and dash upwards to land on the wooden platform. Then, jump onto the spring and maneuver your way over the spikes and fall between the other spikes through that narrow gap. Be careful when you fall, because if you keep falling, you’re going to land on the spikes down the bottom. What you want to do is use your dash at the last second and dash right to the strawberry and to safety.\n\n[iframe](https://www.youtube.com/embed/Os87zotSN84?feature=oembed)\n\n### Strawberry \\#5\n\n![Celeste Strawberry 5](https://i1.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022716422100-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nOnce you make it back to the frame that you were in before, you may think that there is no strawberry to collect. However, there is one in the top left hand corner waiting for you. What you want to do is stand on the conveyor belt platform, and as it shoots upwards, use that momentum to jump at the last second to propel yourself upwards. As you are airborne, move ove"
      }
    ],
    "7": [
      {
        "source_id": 3,
        "source_url": "https://www.ign.com/wikis/celeste/Chapter_1-_Forsaken_City",
        "content": "crystal in this new room and dash again to make it to safe ground. Climb up the wall on the left to find a hidden area.\n\nWatch out for the spring on the ground beneath the spikes! Hop over the hazard and use the second spring to launch toward the wall. Grab it and jump over the spikes toward the green crystal. Dash toward safety and the strawberry. Drop down the passage on the left to see Theo.\n\n### Strawberry \\#8\n\nBack in the room with the green crystal in the center (Reference photo above in Strawberry #7), make your way to the right. Climb up and dash above the crystal so you fall on it to regain your dash. Before hitting the spikes, dash to the right on safe ground. Instead of jumping up, dash through the brown rock to find a hidden strawberry.\n\n### Strawberry \\#9\n\nIn the room with the two geared platforms (one that launches you to the right, the other upward), there is a secret passage that leads to the upper left corner. Using the upward geared platform, jump and dash into the small crevice"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Crystal Heart Checkpoint 1 ‎Crossing‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎‎ Strawberries [x20] Missable 4, 6, 7, 8, 9, 10, 11, 12, 13, 16, 17, 19, 20 Not Missable* 1, 2, 3, 5, 14, 15, 18 ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this guide sometimes I will say: 'Do [x] to grab the strawberry' and 'Do [x] to"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "e strawberry. \n \n \n \n \n Strawberry 6 \n \n [Missable] In the room above the flying strawberry, head to the bottom right of the room and you will see breakable ice - dash into the ice to break it, then enter the room to find strawberry 6. Once inside, jump down avoiding the spikes - then dash up-right onto the traffic light lift and ride it to collect the strawberry. To exit and continue Dash up-left towards the wooden platform with green algae and exit the way you came in - to the left. \n \n \n \n \n Strawberry 7 \n \n [Missable] From the first checkpoint - head left into a room with floor spikes and a green extra dash ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎crystal. Dash up-left falling into the crystal, then dash up-left again to get across the spikes. Head upwards to find the room with strawberry 7. BEWARE OF THE SPRING-PAD BELOW THE SPIKES! Avoiding the spring pad under the spikes, use the ( other) spring-pad to grab onto the first floating platform. Jump over the spikes dashing into the green crystal, then das"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "hen dash up-right onto the traffic light lift and ride it to collect the strawberry. To exit and continue Dash up-left towards the wooden platform with green algae and exit the way you came in - to the left. \n \n \n \n \n Strawberry 7 \n \n [Missable] From the first checkpoint - head left into a room with floor spikes and a green extra dash ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎crystal. Dash up-left falling into the crystal, then dash up-left again to get across the spikes. Head upwards to find the room with strawberry 7. BEWARE OF THE SPRING-PAD BELOW THE SPIKES! Avoiding the spring pad under the spikes, use the ( other) spring-pad to grab onto the first floating platform. Jump over the spikes dashing into the green crystal, then dash onto the platform to collect the strawberry. To exit and continue - Drop down to the left and say hello to Theo👋 - From the room with Theo, head right to revisit the room with floor spikes and green crystal. - Head right again to continue from checkpoint 1. \n \n \n \n \n Strawberry 8"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "and grab that strawberry.\n\n[iframe](https://www.youtube.com/embed/xWW-Ly9tDgQ?feature=oembed)\n\n### Strawberry \\#6\n\n![Celeste Strawberry 6](https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717173600-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nYou may think that you just need to proceed through to the top right of this section. However to get another strawberry, make your way to the **bottom** right of the frame and dash into the wall to uncover a hidden area.\n\n![Celeste Strawberry 7](https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717173900-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nOnce you enter, you’ll want to jump down and hang on to the wall on the left. Give yourself a bit of space to jump from it and hang on to the top-left side of the conveyor belt. As it moves, jump at the right time again and it will propel you over to the strawberry. To get back, just jump off to the left and dash up-left through the wooden platform in the middle of t"
      }
    ],
    "10": [
      {
        "source_id": 3,
        "source_url": "https://www.ign.com/wikis/celeste/Chapter_1-_Forsaken_City",
        "content": "ach color goes to the same spot. These locations are actually directions to dash in and the computer cycle is the order in which you need to dash.\n\nThe solution is Up, Left, Down-Right, Up-Right, Left, Up-Left. Dash in those directions and the Crystal Heart will appear.\n\n### Strawberry \\#10\n\nContinuing to go to the right, after the room with the secret passage in the center, hop on the spring and break the block in the upper left corner. Inside is a room with two green crystals, a spiked floor, Strawberry #10, AND the passage to the next collectible piece of fruit.\n\nUse the crystals to make it to the far wall, wait for them to regenerate and then return safely to the right side of the screen with the fruit.\n\n### Strawberry \\#11\n\nIn the same room as Strawberry #10, climb the right-hand wall to reach the sole platform. Jump out into the middle and dash upward to find a new screen.\n\nClimb through this room, using the falling blocks and the geared platform to make it to the top. In the following room, y"
      },
      {
        "source_id": 3,
        "source_url": "https://www.ign.com/wikis/celeste/Chapter_1-_Forsaken_City",
        "content": "ill appear.\n\n### Strawberry \\#10\n\nContinuing to go to the right, after the room with the secret passage in the center, hop on the spring and break the block in the upper left corner. Inside is a room with two green crystals, a spiked floor, Strawberry #10, AND the passage to the next collectible piece of fruit.\n\nUse the crystals to make it to the far wall, wait for them to regenerate and then return safely to the right side of the screen with the fruit.\n\n### Strawberry \\#11\n\nIn the same room as Strawberry #10, climb the right-hand wall to reach the sole platform. Jump out into the middle and dash upward to find a new screen.\n\nClimb through this room, using the falling blocks and the geared platform to make it to the top. In the following room, you’ll spot the strawberry. Dash and climb your way to the brown platform. Drop down to the strawberry and dash in between the spikes to collect the green crystal. With your dash restored, dash diagonally upward to safety.\n\n### Strawberry \\#12\n\nAdvance a few c"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "ystal Heart Checkpoint 1 ‎Crossing‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎‎ Strawberries [x20] Missable 4, 6, 7, 8, 9, 10, 11, 12, 13, 16, 17, 19, 20 Not Missable* 1, 2, 3, 5, 14, 15, 18 ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this guide sometimes I will say: 'Do [x] to grab the strawberry' and 'Do [x] to collect the strawberry' Grabbed Grabbin"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "6. Yellow Coloured bird directions Left [Purple] Up-Left [Yellow] Up [White] Up-Right [Red] Down-Right [Blue] To reveal the crystal heart you have to dash in the directions: → Up → Left → Down-Right → Up-Right → Left → Up-Left To exit and continue - Head right over the floating platforms into the next room. - Head right again dropping down to the green sign, then heading up and right to drop down ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ from a crumbling platform. - Exit the way you came - to the right. \n \n \n \n \n Strawberry 10 \n \n [Missable] In the room after the up-arrow sign, head to the top-left of the room and dash through the breakable ice. Here you will find strawberry 10 floating near the left wall. Once inside: Use the dash crystals to jump and grab the strawberry, then wait grabbing on the wall until the crystals replenish - using them to get back and collect the strawberry. To continue to strawberry 11 Stay in the current room and continue with 'Strawberry 11' in guide. -------------------------------------"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "h in the directions: → Up → Left → Down-Right → Up-Right → Left → Up-Left To exit and continue - Head right over the floating platforms into the next room. - Head right again dropping down to the green sign, then heading up and right to drop down ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ from a crumbling platform. - Exit the way you came - to the right. \n \n \n \n \n Strawberry 10 \n \n [Missable] In the room after the up-arrow sign, head to the top-left of the room and dash through the breakable ice. Here you will find strawberry 10 floating near the left wall. Once inside: Use the dash crystals to jump and grab the strawberry, then wait grabbing on the wall until the crystals replenish - using them to get back and collect the strawberry. To continue to strawberry 11 Stay in the current room and continue with 'Strawberry 11' in guide. ------------------------------------------------------------------------------------------------------- To exit and continue Exit the strawberry room the way you entered - to the right."
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "p and grab the strawberry, then wait grabbing on the wall until the crystals replenish - using them to get back and collect the strawberry. To continue to strawberry 11 Stay in the current room and continue with 'Strawberry 11' in guide. ------------------------------------------------------------------------------------------------------- To exit and continue Exit the strawberry room the way you entered - to the right. \n \n \n \n \n Strawberry 11 \n \n [Missable] Strawberry 11 takes the same path as strawberry 10, so skip outlined paragraph below if you're following along. After the room with the up-arrow sign, head to the top-left of the room and dash through the breakable ice. Here you will find strawberry 10 floating near the left wall. To get to strawberry 11, jump onto the floating platform above and dash into the breakable ice in the middle of the roof - where you will be taken to another room. In the next room: - Climb up onto the wall to jump onto the crumbling platform, then to the vertical lif"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "inue with 'Strawberry 11' in guide. ------------------------------------------------------------------------------------------------------- To exit and continue Exit the strawberry room the way you entered - to the right. \n \n \n \n \n Strawberry 11 \n \n [Missable] Strawberry 11 takes the same path as strawberry 10, so skip outlined paragraph below if you're following along. After the room with the up-arrow sign, head to the top-left of the room and dash through the breakable ice. Here you will find strawberry 10 floating near the left wall. To get to strawberry 11, jump onto the floating platform above and dash into the breakable ice in the middle of the roof - where you will be taken to another room. In the next room: - Climb up onto the wall to jump onto the crumbling platform, then to the vertical lift. - Use the vertical lift to boost up onto the falling floating ice, then quickly dash to safety. - Make your way to the next room which contains strawberry 11. Once you’re in the strawberry room: - Da"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "h this screen…\n\n![Celeste Strawberry 9](https://i1.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717222200-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nFirst off, head through the left exit into a room with a dash diamond. These diamonds will allow you an extra dash in mid-air. So jump off the platform and dash up-left, fall onto the diamond and dash again to safety. From here, you can go left and meet a main character, but to get the strawberry, we’ll want to go up.\n\n![Celeste Strawberry 10](https://i1.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717241300-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nAs you proceed through this room, be mindful of the spring in front of you (it got me the first time). Jump over that and use the next spring to propel yourself upwards and veer off to the left a bit. Dash up-left over the spikes and collect the diamond, then dash up-left again onto the wooden plank. Now go grab that strawberry!\n\n[iframe](https://www.youtube.com/embe"
      }
    ],
    "18": [
      {
        "source_id": 3,
        "source_url": "https://www.ign.com/wikis/celeste/Chapter_1-_Forsaken_City",
        "content": "the room with the geared platform in the floor, use its upward momentum to fling you to the ground above. Head into the next room to see your next strawberry. After getting the Cassette Tape, use the geared platform to fling yourself across the room to the strawberry.\n\n### Strawberry \\#18\n\nThis strawberry is clear as day in the chasm room. Use the geared platform to launch yourself across the room. When beneath the strawberry’s location, dash up to snag it.\n\n### Strawberry \\#19\n\nAfter snagging Strawberry #18, hop through the floor and go to the right. This room contains another flying strawberry. Use the geared platofrm to launch across the room to the disappearing blocks. Climb the right-hand wall up to the spring and grab the flying fruit.\n\n### Strawberry \\#20\n\nIn the spike room with the blocks that fall when you grab them will be the hiding spot for this strawberry.\n\nThe block in the upper left corner will drop down if you grab it. Drop the block and then dash into the wall that was behind it to"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this guide sometimes I will say: 'Do [x] to grab the strawberry' and 'Do [x] to collect the strawberry' Grabbed Grabbing a strawberry will make it float near you. It is NOT collected and will return to it's original location if you die. ‎ Collected A strawberry will be collected once you touch the ground for a short amount of time. When you c"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "rry 16 and the cassette tape, so skip outlined paragraphs below if you're following along. From checkpoint 2, head for the path behind the traffic light lift. From the next room, use the lift to boost yourself upwards and head into the next room. Once you find the next room, use the lift to boost yourself over the spikes and collect strawberry 17. To exit and continue Head down the hole to return to the lift on the floor we dashed over, then head down again to be back at checkpoint 2. \n \n \n \n \n Strawberry 18 \n \n [Not Missable] From checkpoint 2, use the lift to boost yourself over the chasm. Then from the outer small wooden platform, fall so you are under strawberry 18 and quickly dash upwards to climb up and grab the strawberry. \n \n \n \n \n Strawberry 19 \n \n [Missable] From checkpoint 2, use the traffic light lift to boost yourself over the chasm - continuing right to find the strawberry 19 room. Once inside DON'T DASH Fall down to the lift below to boost yourself right, landing on the crumbling pla"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "the next room, use the lift to boost yourself upwards and head into the next room. Once you find the next room, use the lift to boost yourself over the spikes and collect strawberry 17. To exit and continue Head down the hole to return to the lift on the floor we dashed over, then head down again to be back at checkpoint 2. \n \n \n \n \n Strawberry 18 \n \n [Not Missable] From checkpoint 2, use the lift to boost yourself over the chasm. Then from the outer small wooden platform, fall so you are under strawberry 18 and quickly dash upwards to climb up and grab the strawberry. \n \n \n \n \n Strawberry 19 \n \n [Missable] From checkpoint 2, use the traffic light lift to boost yourself over the chasm - continuing right to find the strawberry 19 room. Once inside DON'T DASH Fall down to the lift below to boost yourself right, landing on the crumbling platform and quickly climbing towards the spring pad. Use the spring pad to grab the strawberry, then dash to land on the platform and collect the berry. \n \n \n \n \n Str"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "nt/uploads/2018/02/2018022717554500-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nIn this next room, dash onto the side of the ice platform. As it is about to fall, jump again onto the platform on the top left. Do a leap of faith to the right and dash onto the three stones hovering. Before they come crashing down jump and dash upwards and land on that tiny little wooden plank next to the traffic lights in the background. Make your way upwards and onto the next secret(ish) area.\n\n![Celeste Strawberry 18](https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717572700-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nJump and grab onto the left side of the conveyor platform, but be sure not to jump off of it until it completely stops (otherwise you’ll be projected up into the spikes at the top). Jump off to the left and grab onto the right side of the other conveyor platform. When that stops, jump over it to the left and dash right (or grab onto the wall to the left and jump righ"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "jPPE?feature=oembed)\n\n### Strawberry \\#13\n\n![Celeste Strawberry 17](https://i2.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717554500-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nNow make your way back to the previous frame, but do not move on as we are not done here yet! Do you see that tiny little gap at the bottom of the screen? Yep, that’s where you want to go! Jump down onto the three crumbling stones, jump to the left and time your dash to the right perfectly.\n\n![Celeste Strawberry 18](https://i2.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022718032400-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nNow this hidden area is all about quick movement! Jump off the wooden plank onto the first conveyor platform. Before that one shoots up, jump to the next one, then the next one, and then get the strawberry and cling on to the wall. Wait for the platforms to come back down and do the same thing to the left of screen. Make your way back up to the previous frame, use th"
      }
    ],
    "1": [
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ \n \n \n \n \n Chapter Overview \n \n ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Crystal Heart Checkpoint 1 ‎Crossing‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎‎ Strawberries [x20] Missable 4, 6, 7, 8, 9, 10, 11, 12, 13, 16, 17, 19, 20 Not Missable* 1, 2, 3, 5, 14, 15, 18 ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the stra"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "is usually indicates a secret passageway to some collectable. When you see these walls, try dashing into them to reveal a secret. \n \n \n \n \n Chapter Map \n \n I've stitched together the map for chapter 1 in Prezi for anyone who wants to explore the map layout. You can drag to look around or press the right arrow button (&gt;) to be taken for a frame-by-frame tour. Hope it helps! •ᴗ• \n \n \n \n \n Video Walkthrough \n \n Contains timestamps in the description for your viewing pleasure (◡ ‿ ◡ ✿) \n \n \n \n \n Strawberry 1 \n \n [Not Missable] After the prologue - when you first start the level, head upwards to the next room and you will see strawberry 1. Jump onto the spring pad and dash towards the strawberry to grab it, making sure to touch the ground to collect the berry. \n \n \n \n \n Strawberry 2 \n \n [Not Missable] Head upwards into the next room from strawberry 1 and you will see strawberry 2. Drop down from the floating platform left of the strawberry to grab it, then dash upwards to climb back up and collect t"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "Chapter Map \n \n I've stitched together the map for chapter 1 in Prezi for anyone who wants to explore the map layout. You can drag to look around or press the right arrow button (&gt;) to be taken for a frame-by-frame tour. Hope it helps! •ᴗ• \n \n \n \n \n Video Walkthrough \n \n Contains timestamps in the description for your viewing pleasure (◡ ‿ ◡ ✿) \n \n \n \n \n Strawberry 1 \n \n [Not Missable] After the prologue - when you first start the level, head upwards to the next room and you will see strawberry 1. Jump onto the spring pad and dash towards the strawberry to grab it, making sure to touch the ground to collect the berry. \n \n \n \n \n Strawberry 2 \n \n [Not Missable] Head upwards into the next room from strawberry 1 and you will see strawberry 2. Drop down from the floating platform left of the strawberry to grab it, then dash upwards to climb back up and collect the berry. \n \n \n \n \n Strawberry 3 \n \n [Not Missable] Progress through the level until you come across a flying strawberry - strawberr"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "-by-frame tour. Hope it helps! •ᴗ• \n \n \n \n \n Video Walkthrough \n \n Contains timestamps in the description for your viewing pleasure (◡ ‿ ◡ ✿) \n \n \n \n \n Strawberry 1 \n \n [Not Missable] After the prologue - when you first start the level, head upwards to the next room and you will see strawberry 1. Jump onto the spring pad and dash towards the strawberry to grab it, making sure to touch the ground to collect the berry. \n \n \n \n \n Strawberry 2 \n \n [Not Missable] Head upwards into the next room from strawberry 1 and you will see strawberry 2. Drop down from the floating platform left of the strawberry to grab it, then dash upwards to climb back up and collect the berry. \n \n \n \n \n Strawberry 3 \n \n [Not Missable] Progress through the level until you come across a flying strawberry - strawberry 3. DON'T DASH as this will cause the strawberry to fly away and you'll have to retry. Jump onto the crumbling platforms then jump down to grab the strawberry, dashing upwards to land back on the platform and collec"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "here](https://go.dabido.com.au/switchabooSkillshare) for a free 1 month trial._\n\nWe know that Celeste tells us that we don’t need to collect every strawberry, but who can resist the challenge?! It’s not easy to 100% this game, but that’s where we come in! Our strawberry guides aim to outline every single strawberry that you can find with images and the occasional video (for when it just gets too complicated to explain with words). So, let’s get into it, shall we?\n\n### Strawberry \\#1\n\n![Celeste Strawberry 1](https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022716274900-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nFor this first strawberry, jump onto the spring button. Once you are airborne, veer off to the left so that you are directly underneath the strawberry and then dash upwards. This one may seem easy, but trust me, they get harder.\n\n[iframe](https://www.youtube.com/embed/01vmyxpt2xg?feature=oembed)\n\n### Strawberry \\#2\n\n![Celeste Strawberry 2](https://i1.wp.com/switchabo"
      }
    ],
    "2": [
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ \n \n \n \n \n Chapter Overview \n \n ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Crystal Heart Checkpoint 1 ‎Crossing‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎‎ Strawberries [x20] Missable 4, 6, 7, 8, 9, 10, 11, 12, 13, 16, 17, 19, 20 Not Missable* 1, 2, 3, 5, 14, 15, 18 ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "around or press the right arrow button (&gt;) to be taken for a frame-by-frame tour. Hope it helps! •ᴗ• \n \n \n \n \n Video Walkthrough \n \n Contains timestamps in the description for your viewing pleasure (◡ ‿ ◡ ✿) \n \n \n \n \n Strawberry 1 \n \n [Not Missable] After the prologue - when you first start the level, head upwards to the next room and you will see strawberry 1. Jump onto the spring pad and dash towards the strawberry to grab it, making sure to touch the ground to collect the berry. \n \n \n \n \n Strawberry 2 \n \n [Not Missable] Head upwards into the next room from strawberry 1 and you will see strawberry 2. Drop down from the floating platform left of the strawberry to grab it, then dash upwards to climb back up and collect the berry. \n \n \n \n \n Strawberry 3 \n \n [Not Missable] Progress through the level until you come across a flying strawberry - strawberry 3. DON'T DASH as this will cause the strawberry to fly away and you'll have to retry. Jump onto the crumbling platforms then jump down to grab th"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "•ᴗ• \n \n \n \n \n Video Walkthrough \n \n Contains timestamps in the description for your viewing pleasure (◡ ‿ ◡ ✿) \n \n \n \n \n Strawberry 1 \n \n [Not Missable] After the prologue - when you first start the level, head upwards to the next room and you will see strawberry 1. Jump onto the spring pad and dash towards the strawberry to grab it, making sure to touch the ground to collect the berry. \n \n \n \n \n Strawberry 2 \n \n [Not Missable] Head upwards into the next room from strawberry 1 and you will see strawberry 2. Drop down from the floating platform left of the strawberry to grab it, then dash upwards to climb back up and collect the berry. \n \n \n \n \n Strawberry 3 \n \n [Not Missable] Progress through the level until you come across a flying strawberry - strawberry 3. DON'T DASH as this will cause the strawberry to fly away and you'll have to retry. Jump onto the crumbling platforms then jump down to grab the strawberry, dashing upwards to land back on the platform and collect it. \n \n \n \n \n Strawberry 4"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "ll the way left. Then jump left over ‎ ‎ ‎ ‎ ‎ the spikes on top, falling to dash right grabbing the strawberry. To exit and continue Exit the same way you entered - from the hole in the floor. \n \n \n \n \n Strawberry 14 \n \n [Not Missable] Progress through the level and you will see strawberry 14. It will be surrounded by spikes in a nook at the top of the screen. I've found two ways you could do this depending on what you find easier: 1. Use the lift to boost yourself the right amount to grab the strawberry 2. Or to be safe - boost off the lift (pressing jump later) to boost below the strawberry, then dashing upwards to grab it without touching the spikes. Dash to the next screen to collect the strawberry, as standing on the lifts doesn't count. \n \n \n \n \n Strawberry 15 \n \n [Not Missable] In the room after strawberry 14, you will see strawberry 15. - Ensure the lift is in the stationary position. - Fall down towards the spikes and dash upwards to grab onto the right side of the lift. - Once the lift"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "## Strawberry \\#1\n\n![Celeste Strawberry 1](https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022716274900-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nFor this first strawberry, jump onto the spring button. Once you are airborne, veer off to the left so that you are directly underneath the strawberry and then dash upwards. This one may seem easy, but trust me, they get harder.\n\n[iframe](https://www.youtube.com/embed/01vmyxpt2xg?feature=oembed)\n\n### Strawberry \\#2\n\n![Celeste Strawberry 2](https://i1.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022716300800-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nMake your way over to the right side of the screen. Drop down, and without using your dash, hold ZR and grab onto the lower part of the right wall. When you’re ready, kick off from the wall, grab the strawberry and then use your boost to grab onto the wall that is parallel to the one that you just jumped from. Make your way back up by jumping from one side to the oth"
      }
    ],
    "3": [
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ \n \n \n \n \n Chapter Overview \n \n ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Crystal Heart Checkpoint 1 ‎Crossing‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎‎ Strawberries [x20] Missable 4, 6, 7, 8, 9, 10, 11, 12, 13, 16, 17, 19, 20 Not Missable* 1, 2, 3, 5, 14, 15, 18 ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarifica"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "After the prologue - when you first start the level, head upwards to the next room and you will see strawberry 1. Jump onto the spring pad and dash towards the strawberry to grab it, making sure to touch the ground to collect the berry. \n \n \n \n \n Strawberry 2 \n \n [Not Missable] Head upwards into the next room from strawberry 1 and you will see strawberry 2. Drop down from the floating platform left of the strawberry to grab it, then dash upwards to climb back up and collect the berry. \n \n \n \n \n Strawberry 3 \n \n [Not Missable] Progress through the level until you come across a flying strawberry - strawberry 3. DON'T DASH as this will cause the strawberry to fly away and you'll have to retry. Jump onto the crumbling platforms then jump down to grab the strawberry, dashing upwards to land back on the platform and collect it. \n \n \n \n \n Strawberry 4 \n \n [Missable] In the room above the flying strawberry, head left towards the glow to find strawberry 4. Once inside the strawberry room: Head towards the"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "awberry 1. Jump onto the spring pad and dash towards the strawberry to grab it, making sure to touch the ground to collect the berry. \n \n \n \n \n Strawberry 2 \n \n [Not Missable] Head upwards into the next room from strawberry 1 and you will see strawberry 2. Drop down from the floating platform left of the strawberry to grab it, then dash upwards to climb back up and collect the berry. \n \n \n \n \n Strawberry 3 \n \n [Not Missable] Progress through the level until you come across a flying strawberry - strawberry 3. DON'T DASH as this will cause the strawberry to fly away and you'll have to retry. Jump onto the crumbling platforms then jump down to grab the strawberry, dashing upwards to land back on the platform and collect it. \n \n \n \n \n Strawberry 4 \n \n [Missable] In the room above the flying strawberry, head left towards the glow to find strawberry 4. Once inside the strawberry room: Head towards the platform in the middle of the screen covered in snow, dashing up onto the spring pad over the spikes, t"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "een. Drop down, and without using your dash, hold ZR and grab onto the lower part of the right wall. When you’re ready, kick off from the wall, grab the strawberry and then use your boost to grab onto the wall that is parallel to the one that you just jumped from. Make your way back up by jumping from one side to the other until you are back up on the flat surface that you initially jumped off of.\n\n[iframe](https://www.youtube.com/embed/RBj4MXUFXeI?feature=oembed)\n\n### Strawberry \\#3\n\n![Celeste Strawberry 3](https://i1.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022716333900-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nIn the next room, if you notice the sign that has an up arrow with a line through it, that means that if you try to jump and dash toward the strawberry from below, then it’s going to fly away (who knew strawberries could fly…). Instead, you have to make your way to the right of screen and jump from those platforms. But look out, they’ll crumble if you’re not quick en"
      }
    ],
    "4": [
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": ". ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ \n \n \n \n \n Chapter Overview \n \n ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Crystal Heart Checkpoint 1 ‎Crossing‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎‎ Strawberries [x20] Missable 4, 6, 7, 8, 9, 10, 11, 12, 13, 16, 17, 19, 20 Not Missable* 1, 2, 3, 5, 14, 15, 18 ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "e strawberry 2. Drop down from the floating platform left of the strawberry to grab it, then dash upwards to climb back up and collect the berry. \n \n \n \n \n Strawberry 3 \n \n [Not Missable] Progress through the level until you come across a flying strawberry - strawberry 3. DON'T DASH as this will cause the strawberry to fly away and you'll have to retry. Jump onto the crumbling platforms then jump down to grab the strawberry, dashing upwards to land back on the platform and collect it. \n \n \n \n \n Strawberry 4 \n \n [Missable] In the room above the flying strawberry, head left towards the glow to find strawberry 4. Once inside the strawberry room: Head towards the platform in the middle of the screen covered in snow, dashing up onto the spring pad over the spikes, then dashing right to collect the strawberry. To exit and continue Exit the strawberry room the way you entered - to the right. \n \n \n \n \n Strawberry 5 \n \n [Not Missable] In the room above the flying strawberry you'll find strawberry 5. Use th"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "s to climb back up and collect the berry. \n \n \n \n \n Strawberry 3 \n \n [Not Missable] Progress through the level until you come across a flying strawberry - strawberry 3. DON'T DASH as this will cause the strawberry to fly away and you'll have to retry. Jump onto the crumbling platforms then jump down to grab the strawberry, dashing upwards to land back on the platform and collect it. \n \n \n \n \n Strawberry 4 \n \n [Missable] In the room above the flying strawberry, head left towards the glow to find strawberry 4. Once inside the strawberry room: Head towards the platform in the middle of the screen covered in snow, dashing up onto the spring pad over the spikes, then dashing right to collect the strawberry. To exit and continue Exit the strawberry room the way you entered - to the right. \n \n \n \n \n Strawberry 5 \n \n [Not Missable] In the room above the flying strawberry you'll find strawberry 5. Use the traffic light lift to boost yourself up and grab onto the floating ice with spikes, jumping to dash on"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "ave to make your way to the right of screen and jump from those platforms. But look out, they’ll crumble if you’re not quick enough. You don’t have to use the highest crumbling platform, and instead just jump from the second highest platform and cling onto the wall of the floating island in the middle and climb up. From there, make your way to the other side, drop down and collect your strawberry.\n\n[iframe](https://www.youtube.com/embed/vH-CmQsdOGk?feature=oembed)\n\n### Strawberry \\#4\n\n![Celeste Strawberry 4](https://i1.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022716370900-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nWhen you proceed upwards, take a left and you’ll enter a side room with another strawberry. In this frame, make your way to the middle section and jump up to the first step. From there, jump and grab onto the wall on the right and then kick off and dash upwards to land on the wooden platform. Then, jump onto the spring and maneuver your way over the spikes and fall b"
      }
    ],
    "6": [
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ \n \n \n \n \n Chapter Overview \n \n ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Crystal Heart Checkpoint 1 ‎Crossing‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎‎ Strawberries [x20] Missable 4, 6, 7, 8, 9, 10, 11, 12, 13, 16, 17, 19, 20 Not Missable* 1, 2, 3, 5, 14, 15, 18 ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this guide sometimes I will sa"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "atform in the middle of the screen covered in snow, dashing up onto the spring pad over the spikes, then dashing right to collect the strawberry. To exit and continue Exit the strawberry room the way you entered - to the right. \n \n \n \n \n Strawberry 5 \n \n [Not Missable] In the room above the flying strawberry you'll find strawberry 5. Use the traffic light lift to boost yourself up and grab onto the floating ice with spikes, jumping to dash onto the platform and collect the strawberry. \n \n \n \n \n Strawberry 6 \n \n [Missable] In the room above the flying strawberry, head to the bottom right of the room and you will see breakable ice - dash into the ice to break it, then enter the room to find strawberry 6. Once inside, jump down avoiding the spikes - then dash up-right onto the traffic light lift and ride it to collect the strawberry. To exit and continue Dash up-left towards the wooden platform with green algae and exit the way you came in - to the left. \n \n \n \n \n Strawberry 7 \n \n [Missable] From the"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "y you entered - to the right. \n \n \n \n \n Strawberry 5 \n \n [Not Missable] In the room above the flying strawberry you'll find strawberry 5. Use the traffic light lift to boost yourself up and grab onto the floating ice with spikes, jumping to dash onto the platform and collect the strawberry. \n \n \n \n \n Strawberry 6 \n \n [Missable] In the room above the flying strawberry, head to the bottom right of the room and you will see breakable ice - dash into the ice to break it, then enter the room to find strawberry 6. Once inside, jump down avoiding the spikes - then dash up-right onto the traffic light lift and ride it to collect the strawberry. To exit and continue Dash up-left towards the wooden platform with green algae and exit the way you came in - to the left. \n \n \n \n \n Strawberry 7 \n \n [Missable] From the first checkpoint - head left into a room with floor spikes and a green extra dash ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎crystal. Dash up-left falling into the crystal, then dash up-left again to get across"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "the top left hand corner waiting for you. What you want to do is stand on the conveyor belt platform, and as it shoots upwards, use that momentum to jump at the last second to propel yourself upwards. As you are airborne, move over to the left towards the floating platform and hang on to the right side of it for dear life. Climb up a bit and as you jump off, dash up-left and grab that strawberry.\n\n[iframe](https://www.youtube.com/embed/xWW-Ly9tDgQ?feature=oembed)\n\n### Strawberry \\#6\n\n![Celeste Strawberry 6](https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717173600-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nYou may think that you just need to proceed through to the top right of this section. However to get another strawberry, make your way to the **bottom** right of the frame and dash into the wall to uncover a hidden area.\n\n![Celeste Strawberry 7](https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717173900-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ss"
      }
    ],
    "8": [
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "‎‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Crystal Heart Checkpoint 1 ‎Crossing‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎‎ Strawberries [x20] Missable 4, 6, 7, 8, 9, 10, 11, 12, 13, 16, 17, 19, 20 Not Missable* 1, 2, 3, 5, 14, 15, 18 ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this guide sometimes I will say: 'Do [x] to grab the strawberry' and 'Do [x] to collect the"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "strawberry 7. BEWARE OF THE SPRING-PAD BELOW THE SPIKES! Avoiding the spring pad under the spikes, use the ( other) spring-pad to grab onto the first floating platform. Jump over the spikes dashing into the green crystal, then dash onto the platform to collect the strawberry. To exit and continue - Drop down to the left and say hello to Theo👋 - From the room with Theo, head right to revisit the room with floor spikes and green crystal. - Head right again to continue from checkpoint 1. \n \n \n \n \n Strawberry 8 \n \n [Missable] Strawberry 8 is hidden - so from the first checkpoint, look to the right and you will see breakable dirt between two wooden platforms. Dash into the dirt and head inside to reveal the hidden strawberry. \n \n \n \n \n Strawberry 9 \n \n [Missable] Progress throughout the level until you enter the room with an up arrow sign, a horizontal lift, and a vertical lift. On the vertical traffic light lift, boost left of the arrow sign to unlock a secret passage. Dash onto the platform to the le"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "SPRING-PAD BELOW THE SPIKES! Avoiding the spring pad under the spikes, use the ( other) spring-pad to grab onto the first floating platform. Jump over the spikes dashing into the green crystal, then dash onto the platform to collect the strawberry. To exit and continue - Drop down to the left and say hello to Theo👋 - From the room with Theo, head right to revisit the room with floor spikes and green crystal. - Head right again to continue from checkpoint 1. \n \n \n \n \n Strawberry 8 \n \n [Missable] Strawberry 8 is hidden - so from the first checkpoint, look to the right and you will see breakable dirt between two wooden platforms. Dash into the dirt and head inside to reveal the hidden strawberry. \n \n \n \n \n Strawberry 9 \n \n [Missable] Progress throughout the level until you enter the room with an up arrow sign, a horizontal lift, and a vertical lift. On the vertical traffic light lift, boost left of the arrow sign to unlock a secret passage. Dash onto the platform to the left and head through to the n"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "11.jpg?w=1280&ssl=1)\n\nOnce you enter, you’ll want to jump down and hang on to the wall on the left. Give yourself a bit of space to jump from it and hang on to the top-left side of the conveyor belt. As it moves, jump at the right time again and it will propel you over to the strawberry. To get back, just jump off to the left and dash up-left through the wooden platform in the middle of the frame.\n\n[iframe](https://www.youtube.com/embed/z_R9m6fT59M?feature=oembed)\n\n### Strawberry \\#7\n\n![Celeste Strawberry 8](https://i1.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717210800-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nNow we’ll make our way to the previous frame and go up. We will then be presented with this screen…\n\n![Celeste Strawberry 9](https://i1.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717222200-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nFirst off, head through the left exit into a room with a dash diamond. These diamonds will allow you an extra dash"
      }
    ],
    "9": [
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "‎ ‎ ‎ ‎ ‎ Crystal Heart Checkpoint 1 ‎Crossing‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎‎ Strawberries [x20] Missable 4, 6, 7, 8, 9, 10, 11, 12, 13, 16, 17, 19, 20 Not Missable* 1, 2, 3, 5, 14, 15, 18 ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this guide sometimes I will say: 'Do [x] to grab the strawberry' and 'Do [x] to collect the strawberry' G"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "platform to collect the strawberry. To exit and continue - Drop down to the left and say hello to Theo👋 - From the room with Theo, head right to revisit the room with floor spikes and green crystal. - Head right again to continue from checkpoint 1. \n \n \n \n \n Strawberry 8 \n \n [Missable] Strawberry 8 is hidden - so from the first checkpoint, look to the right and you will see breakable dirt between two wooden platforms. Dash into the dirt and head inside to reveal the hidden strawberry. \n \n \n \n \n Strawberry 9 \n \n [Missable] Progress throughout the level until you enter the room with an up arrow sign, a horizontal lift, and a vertical lift. On the vertical traffic light lift, boost left of the arrow sign to unlock a secret passage. Dash onto the platform to the left and head through to the next room. Once you're in the next room: - Use the spring pad to dash up and climb up the wall. - Grab onto the traffic light lift to lower it, then quickly jump over the spikes. - Grab onto second lift and ride it"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "nd climb up the wall. - Grab onto the traffic light lift to lower it, then quickly jump over the spikes. - Grab onto second lift and ride it all the way left, then climb into the nook above and wait for the ‎ ‎ ‎ ‎‎lift to pass. - Once clear, let go of grab, dash left and climb onto the wooden platform using the rest of your ‎ ‎ ‎ ‎ ‎ ‎ stamina. - Head up and left into the next room - an open room with floating platforms. Head left, dashing across the floating platforms and you will come across strawberry 9 and the crystal heart location. To continue to the Crystal Heart Stay in the current room and continue with 'Crystal Heart' in guide. ------------------------------------------------------------------------------------------------------- To exit and continue - Head right over the floating platforms into the next room. - Head right again dropping down to the green sign, then heading up and right to drop down ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ from a crumbling platform. - Exit the way you came - to the right."
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "e Crystal Heart Stay in the current room and continue with 'Crystal Heart' in guide. ------------------------------------------------------------------------------------------------------- To exit and continue - Head right over the floating platforms into the next room. - Head right again dropping down to the green sign, then heading up and right to drop down ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ from a crumbling platform. - Exit the way you came - to the right. \n \n \n \n \n Crystal Heart \n \n In the same place as strawberry 9, you will come across a small computer screen with flashing colours and colourful birds flying around. The birds represent directions to dash, and the colours on the computer screen represent the order you have to do it in. Therefore, to reveal the crystal heart you have to dash in the direction of the birds, in the order of colours on the screen. Once revealed, you have to dash into the crystal heart to collect it. [Directions you have to dash listed below] Screen with colour order 1. White 2."
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "propel you over to the strawberry. To get back, just jump off to the left and dash up-left through the wooden platform in the middle of the frame.\n\n[iframe](https://www.youtube.com/embed/z_R9m6fT59M?feature=oembed)\n\n### Strawberry \\#7\n\n![Celeste Strawberry 8](https://i1.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717210800-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nNow we’ll make our way to the previous frame and go up. We will then be presented with this screen…\n\n![Celeste Strawberry 9](https://i1.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717222200-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nFirst off, head through the left exit into a room with a dash diamond. These diamonds will allow you an extra dash in mid-air. So jump off the platform and dash up-left, fall onto the diamond and dash again to safety. From here, you can go left and meet a main character, but to get the strawberry, we’ll want to go up.\n\n![Celeste Strawberry 10](https://i1.wp.com/switc"
      }
    ],
    "11": [
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "eckpoint 1 ‎Crossing‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎‎ Strawberries [x20] Missable 4, 6, 7, 8, 9, 10, 11, 12, 13, 16, 17, 19, 20 Not Missable* 1, 2, 3, 5, 14, 15, 18 ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this guide sometimes I will say: 'Do [x] to grab the strawberry' and 'Do [x] to collect the strawberry' Grabbed Grabbing a strawberry"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "op down ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ from a crumbling platform. - Exit the way you came - to the right. \n \n \n \n \n Strawberry 10 \n \n [Missable] In the room after the up-arrow sign, head to the top-left of the room and dash through the breakable ice. Here you will find strawberry 10 floating near the left wall. Once inside: Use the dash crystals to jump and grab the strawberry, then wait grabbing on the wall until the crystals replenish - using them to get back and collect the strawberry. To continue to strawberry 11 Stay in the current room and continue with 'Strawberry 11' in guide. ------------------------------------------------------------------------------------------------------- To exit and continue Exit the strawberry room the way you entered - to the right. \n \n \n \n \n Strawberry 11 \n \n [Missable] Strawberry 11 takes the same path as strawberry 10, so skip outlined paragraph below if you're following along. After the room with the up-arrow sign, head to the top-left of the room and dash through the"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "Exit the way you came - to the right. \n \n \n \n \n Strawberry 10 \n \n [Missable] In the room after the up-arrow sign, head to the top-left of the room and dash through the breakable ice. Here you will find strawberry 10 floating near the left wall. Once inside: Use the dash crystals to jump and grab the strawberry, then wait grabbing on the wall until the crystals replenish - using them to get back and collect the strawberry. To continue to strawberry 11 Stay in the current room and continue with 'Strawberry 11' in guide. ------------------------------------------------------------------------------------------------------- To exit and continue Exit the strawberry room the way you entered - to the right. \n \n \n \n \n Strawberry 11 \n \n [Missable] Strawberry 11 takes the same path as strawberry 10, so skip outlined paragraph below if you're following along. After the room with the up-arrow sign, head to the top-left of the room and dash through the breakable ice. Here you will find strawberry 10 floating n"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "ting near the left wall. Once inside: Use the dash crystals to jump and grab the strawberry, then wait grabbing on the wall until the crystals replenish - using them to get back and collect the strawberry. To continue to strawberry 11 Stay in the current room and continue with 'Strawberry 11' in guide. ------------------------------------------------------------------------------------------------------- To exit and continue Exit the strawberry room the way you entered - to the right. \n \n \n \n \n Strawberry 11 \n \n [Missable] Strawberry 11 takes the same path as strawberry 10, so skip outlined paragraph below if you're following along. After the room with the up-arrow sign, head to the top-left of the room and dash through the breakable ice. Here you will find strawberry 10 floating near the left wall. To get to strawberry 11, jump onto the floating platform above and dash into the breakable ice in the middle of the roof - where you will be taken to another room. In the next room: - Climb up onto the"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "inside: Use the dash crystals to jump and grab the strawberry, then wait grabbing on the wall until the crystals replenish - using them to get back and collect the strawberry. To continue to strawberry 11 Stay in the current room and continue with 'Strawberry 11' in guide. ------------------------------------------------------------------------------------------------------- To exit and continue Exit the strawberry room the way you entered - to the right. \n \n \n \n \n Strawberry 11 \n \n [Missable] Strawberry 11 takes the same path as strawberry 10, so skip outlined paragraph below if you're following along. After the room with the up-arrow sign, head to the top-left of the room and dash through the breakable ice. Here you will find strawberry 10 floating near the left wall. To get to strawberry 11, jump onto the floating platform above and dash into the breakable ice in the middle of the roof - where you will be taken to another room. In the next room: - Climb up onto the wall to jump onto the crumbli"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "-------------------------------------------------------------------------------------- To exit and continue Exit the strawberry room the way you entered - to the right. \n \n \n \n \n Strawberry 11 \n \n [Missable] Strawberry 11 takes the same path as strawberry 10, so skip outlined paragraph below if you're following along. After the room with the up-arrow sign, head to the top-left of the room and dash through the breakable ice. Here you will find strawberry 10 floating near the left wall. To get to strawberry 11, jump onto the floating platform above and dash into the breakable ice in the middle of the roof - where you will be taken to another room. In the next room: - Climb up onto the wall to jump onto the crumbling platform, then to the vertical lift. - Use the vertical lift to boost up onto the falling floating ice, then quickly dash to safety. - Make your way to the next room which contains strawberry 11. Once you’re in the strawberry room: - Dash onto the dirt platform. - Fall to grab the strawbe"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "ugh the breakable ice. Here you will find strawberry 10 floating near the left wall. To get to strawberry 11, jump onto the floating platform above and dash into the breakable ice in the middle of the roof - where you will be taken to another room. In the next room: - Climb up onto the wall to jump onto the crumbling platform, then to the vertical lift. - Use the vertical lift to boost up onto the falling floating ice, then quickly dash to safety. - Make your way to the next room which contains strawberry 11. Once you’re in the strawberry room: - Dash onto the dirt platform. - Fall to grab the strawberry then dash right to collect the crystal, dashing up-right to land safely ‎ ‎ ‎ ‎ and ‎collect the strawberry. To exit and continue Continue right once you've collected strawberry 11, where you will fall down a 1x1 crumbling platform. \n \n \n \n \n Strawberry 12 \n \n [Missable] In the screen after strawberry 11 or after the two floating and falling platforms (depending if you took the path of strawberry 1"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "nto the wall to jump onto the crumbling platform, then to the vertical lift. - Use the vertical lift to boost up onto the falling floating ice, then quickly dash to safety. - Make your way to the next room which contains strawberry 11. Once you’re in the strawberry room: - Dash onto the dirt platform. - Fall to grab the strawberry then dash right to collect the crystal, dashing up-right to land safely ‎ ‎ ‎ ‎ and ‎collect the strawberry. To exit and continue Continue right once you've collected strawberry 11, where you will fall down a 1x1 crumbling platform. \n \n \n \n \n Strawberry 12 \n \n [Missable] In the screen after strawberry 11 or after the two floating and falling platforms (depending if you took the path of strawberry 11 or not) you will see: - Spikes on the floor - Floating ice with spikes - And green algae hanging down from a platform. ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ [You are aiming for the hole in the floor under the wooden platform with spikes.] - Jump and climb the floating ice and dash onto the a"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "ling floating ice, then quickly dash to safety. - Make your way to the next room which contains strawberry 11. Once you’re in the strawberry room: - Dash onto the dirt platform. - Fall to grab the strawberry then dash right to collect the crystal, dashing up-right to land safely ‎ ‎ ‎ ‎ and ‎collect the strawberry. To exit and continue Continue right once you've collected strawberry 11, where you will fall down a 1x1 crumbling platform. \n \n \n \n \n Strawberry 12 \n \n [Missable] In the screen after strawberry 11 or after the two floating and falling platforms (depending if you took the path of strawberry 11 or not) you will see: - Spikes on the floor - Floating ice with spikes - And green algae hanging down from a platform. ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ [You are aiming for the hole in the floor under the wooden platform with spikes.] - Jump and climb the floating ice and dash onto the algae platform before the ice falls. - From the platform, fall towards the spikes below before quickly dashing right to fall d"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "trawberry 11. Once you’re in the strawberry room: - Dash onto the dirt platform. - Fall to grab the strawberry then dash right to collect the crystal, dashing up-right to land safely ‎ ‎ ‎ ‎ and ‎collect the strawberry. To exit and continue Continue right once you've collected strawberry 11, where you will fall down a 1x1 crumbling platform. \n \n \n \n \n Strawberry 12 \n \n [Missable] In the screen after strawberry 11 or after the two floating and falling platforms (depending if you took the path of strawberry 11 or not) you will see: - Spikes on the floor - Floating ice with spikes - And green algae hanging down from a platform. ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ [You are aiming for the hole in the floor under the wooden platform with spikes.] - Jump and climb the floating ice and dash onto the algae platform before the ice falls. - From the platform, fall towards the spikes below before quickly dashing right to fall down the ‎ ‎ ‎ ‎ ‎ ‎‎‎ ‎ ‎ ‎hole. The room with strawberry 12 has three traffic light lifts with t"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "/2018022717241300-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nAs you proceed through this room, be mindful of the spring in front of you (it got me the first time). Jump over that and use the next spring to propel yourself upwards and veer off to the left a bit. Dash up-left over the spikes and collect the diamond, then dash up-left again onto the wooden plank. Now go grab that strawberry!\n\n[iframe](https://www.youtube.com/embed/ydA_de92L5s?feature=oembed)\n\n### Strawberry \\#8\n\n![Celeste Strawberry 11](https://i1.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717281800-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nGo back to the screen where we went left and make your way to the longer wooden platform on the bottom right of the screen. Dash into the wall to reveal another hidden area. Here is another strawberry!\n\n[iframe](https://www.youtube.com/embed/YPzArQUgUpY?feature=oembed)\n\n### Strawberry \\#9\n\n![Celeste Strawberry 12](https://i1.wp.com/switchaboo.com/wp-content/uploads/2"
      }
    ],
    "12": [
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "ossing‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎‎ Strawberries [x20] Missable 4, 6, 7, 8, 9, 10, 11, 12, 13, 16, 17, 19, 20 Not Missable* 1, 2, 3, 5, 14, 15, 18 ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this guide sometimes I will say: 'Do [x] to grab the strawberry' and 'Do [x] to collect the strawberry' Grabbed Grabbing a strawberry will make it"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "- Use the vertical lift to boost up onto the falling floating ice, then quickly dash to safety. - Make your way to the next room which contains strawberry 11. Once you’re in the strawberry room: - Dash onto the dirt platform. - Fall to grab the strawberry then dash right to collect the crystal, dashing up-right to land safely ‎ ‎ ‎ ‎ and ‎collect the strawberry. To exit and continue Continue right once you've collected strawberry 11, where you will fall down a 1x1 crumbling platform. \n \n \n \n \n Strawberry 12 \n \n [Missable] In the screen after strawberry 11 or after the two floating and falling platforms (depending if you took the path of strawberry 11 or not) you will see: - Spikes on the floor - Floating ice with spikes - And green algae hanging down from a platform. ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ [You are aiming for the hole in the floor under the wooden platform with spikes.] - Jump and climb the floating ice and dash onto the algae platform before the ice falls. - From the platform, fall towards the sp"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "s (depending if you took the path of strawberry 11 or not) you will see: - Spikes on the floor - Floating ice with spikes - And green algae hanging down from a platform. ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ [You are aiming for the hole in the floor under the wooden platform with spikes.] - Jump and climb the floating ice and dash onto the algae platform before the ice falls. - From the platform, fall towards the spikes below before quickly dashing right to fall down the ‎ ‎ ‎ ‎ ‎ ‎‎‎ ‎ ‎ ‎hole. The room with strawberry 12 has three traffic light lifts with the strawberry floating near the right wall. Jump on each of the lifts without getting squished and grab the strawberry, then wait for the lifts to reset before jumping back to collect the strawberry. To exit and continue - Dash up the wider passage-way not surrounded by spikes where you'll be taken to a secret ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎nook in the previous room. - Jump on the spring-pad onto the crumbling platform, jumping back to safety. \n \n \n \n \n Strawberry 13"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "de92L5s?feature=oembed)\n\n### Strawberry \\#8\n\n![Celeste Strawberry 11](https://i1.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717281800-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nGo back to the screen where we went left and make your way to the longer wooden platform on the bottom right of the screen. Dash into the wall to reveal another hidden area. Here is another strawberry!\n\n[iframe](https://www.youtube.com/embed/YPzArQUgUpY?feature=oembed)\n\n### Strawberry \\#9\n\n![Celeste Strawberry 12](https://i1.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717341400-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nMake your way through the next screen (as there are no strawberries here) and then you’ll be in a room with two conveyor belt platforms. Now this part is tricky, so perhaps a little stretch before you attempt it may help…\n\nSee that arrow above? Well that’s where you want to go. Jump onto the first platform and propel yourself to the next one, but try not to go too fa"
      }
    ],
    "13": [
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎‎ Strawberries [x20] Missable 4, 6, 7, 8, 9, 10, 11, 12, 13, 16, 17, 19, 20 Not Missable* 1, 2, 3, 5, 14, 15, 18 ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this guide sometimes I will say: 'Do [x] to grab the strawberry' and 'Do [x] to collect the strawberry' Grabbed Grabbing a strawberry will make it float near you"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "strawberry 12 has three traffic light lifts with the strawberry floating near the right wall. Jump on each of the lifts without getting squished and grab the strawberry, then wait for the lifts to reset before jumping back to collect the strawberry. To exit and continue - Dash up the wider passage-way not surrounded by spikes where you'll be taken to a secret ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎nook in the previous room. - Jump on the spring-pad onto the crumbling platform, jumping back to safety. \n \n \n \n \n Strawberry 13 \n \n [Missable] In the same room as the floor spikes, floating ice platform, and green algae platform - head upwards through the hole in the roof to find the room with strawberry 13. Once inside: - Jump and climb to the top of the square traffic light lift (so you'll be able to make the jump) and ‎ ‎ ‎ ‎‎wait until it stops before jumping off - as you'll die on the spikes. - From the square lift, jump onto the rectangle lift and ride it all the way left. Then jump left over ‎ ‎ ‎ ‎ ‎ the spikes"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "or the lifts to reset before jumping back to collect the strawberry. To exit and continue - Dash up the wider passage-way not surrounded by spikes where you'll be taken to a secret ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎nook in the previous room. - Jump on the spring-pad onto the crumbling platform, jumping back to safety. \n \n \n \n \n Strawberry 13 \n \n [Missable] In the same room as the floor spikes, floating ice platform, and green algae platform - head upwards through the hole in the roof to find the room with strawberry 13. Once inside: - Jump and climb to the top of the square traffic light lift (so you'll be able to make the jump) and ‎ ‎ ‎ ‎‎wait until it stops before jumping off - as you'll die on the spikes. - From the square lift, jump onto the rectangle lift and ride it all the way left. Then jump left over ‎ ‎ ‎ ‎ ‎ the spikes on top, falling to dash right grabbing the strawberry. To exit and continue Exit the same way you entered - from the hole in the floor. \n \n \n \n \n Strawberry 14 \n \n [Not Missable] Pr"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "e right wall and cling onto it again. When the conveyor platform is down, jump left and over the top of the spikes to land safely on the other side.\n\nNow, grab onto the right side of the platform and when it moves, jump and cling on to the right wall above it. When the platform moves back, move down and grab onto the left side of it. When it moves, you’ll be able to make your way up onto a wooden platform. Make your way up to the top left of the screen, and proceed to the next frame.\n\n![Celeste Strawberry 13](https://i2.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717423300-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nJump and dash from one platform to another and make your way to the strawberry next to the computer. And watch the pretty birds (ooh, pretty!). Actually, you really do need to watch the pretty birds, as this is how to get this chapter’s Crystal Heart. We’ll have our full Crystal Heart guide up very soon.\n\n[iframe](https://www.youtube.com/embed/gS9NjlMTi5Q?feature=oem"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "wooden plank onto the first conveyor platform. Before that one shoots up, jump to the next one, then the next one, and then get the strawberry and cling on to the wall. Wait for the platforms to come back down and do the same thing to the left of screen. Make your way back up to the previous frame, use the spring to jump up onto the stones, dash up to the plank and move onward to the next frame.\n\n[iframe](https://www.youtube.com/embed/3AUYRszDJ3U?feature=oembed)\n\n### Strawberry \\#14\n\n![Celeste Strawberry 13](https://i2.wp.com/switchaboo.com/wp-content/uploads/2018/03/2018022718061300-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nNow this next one is tricky, so we added a video below to show you. But to put it into words, make your way down and cling onto the right side of the wall below you. Jump right and dash onto the conveyor platform. Move over to the right of the platform and as it shoots up, at the last second you want to jump slightly to the right and use that momentum to propel Madel"
      }
    ],
    "14": [
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎‎ Strawberries [x20] Missable 4, 6, 7, 8, 9, 10, 11, 12, 13, 16, 17, 19, 20 Not Missable* 1, 2, 3, 5, 14, 15, 18 ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this guide sometimes I will say: 'Do [x] to grab the strawberry' and 'Do [x] to collect the strawberry' Grabbed Grabbing a strawberry will make it float near you. It is NOT co"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "to find the room with strawberry 13. Once inside: - Jump and climb to the top of the square traffic light lift (so you'll be able to make the jump) and ‎ ‎ ‎ ‎‎wait until it stops before jumping off - as you'll die on the spikes. - From the square lift, jump onto the rectangle lift and ride it all the way left. Then jump left over ‎ ‎ ‎ ‎ ‎ the spikes on top, falling to dash right grabbing the strawberry. To exit and continue Exit the same way you entered - from the hole in the floor. \n \n \n \n \n Strawberry 14 \n \n [Not Missable] Progress through the level and you will see strawberry 14. It will be surrounded by spikes in a nook at the top of the screen. I've found two ways you could do this depending on what you find easier: 1. Use the lift to boost yourself the right amount to grab the strawberry 2. Or to be safe - boost off the lift (pressing jump later) to boost below the strawberry, then dashing upwards to grab it without touching the spikes. Dash to the next screen to collect the strawberry, as"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "of the square traffic light lift (so you'll be able to make the jump) and ‎ ‎ ‎ ‎‎wait until it stops before jumping off - as you'll die on the spikes. - From the square lift, jump onto the rectangle lift and ride it all the way left. Then jump left over ‎ ‎ ‎ ‎ ‎ the spikes on top, falling to dash right grabbing the strawberry. To exit and continue Exit the same way you entered - from the hole in the floor. \n \n \n \n \n Strawberry 14 \n \n [Not Missable] Progress through the level and you will see strawberry 14. It will be surrounded by spikes in a nook at the top of the screen. I've found two ways you could do this depending on what you find easier: 1. Use the lift to boost yourself the right amount to grab the strawberry 2. Or to be safe - boost off the lift (pressing jump later) to boost below the strawberry, then dashing upwards to grab it without touching the spikes. Dash to the next screen to collect the strawberry, as standing on the lifts doesn't count. \n \n \n \n \n Strawberry 15 \n \n [Not Missabl"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "ed by spikes in a nook at the top of the screen. I've found two ways you could do this depending on what you find easier: 1. Use the lift to boost yourself the right amount to grab the strawberry 2. Or to be safe - boost off the lift (pressing jump later) to boost below the strawberry, then dashing upwards to grab it without touching the spikes. Dash to the next screen to collect the strawberry, as standing on the lifts doesn't count. \n \n \n \n \n Strawberry 15 \n \n [Not Missable] In the room after strawberry 14, you will see strawberry 15. - Ensure the lift is in the stationary position. - Fall down towards the spikes and dash upwards to grab onto the right side of the lift. - Once the lift moves you towards the strawberry, you have to quickly jump, grab onto the wall‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ to grab the berry, then quickly jump back onto the lift before it moves away. - As the lift slowly moves back, jump onto the wooden platform to collect the strawberry. \n \n \n \n \n Strawberry 16 \n \n [Missable] From checkpo"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "-content/uploads/2018/02/2018022717423300-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nJump and dash from one platform to another and make your way to the strawberry next to the computer. And watch the pretty birds (ooh, pretty!). Actually, you really do need to watch the pretty birds, as this is how to get this chapter’s Crystal Heart. We’ll have our full Crystal Heart guide up very soon.\n\n[iframe](https://www.youtube.com/embed/gS9NjlMTi5Q?feature=oembed)\n\n### Strawberry \\#10\n\n![Celeste Strawberry 14](https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717461000-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nGo back the way you came and in the next frame, go up and over just to drop down as the crumbling bricks fall.\n\nNow that you’re back, jump into the hidden area that we found before (just above where the sign was), make your way up and through to the next frame.\n\nNow if you look closely at this one, you can see that there is a crumbly wall in the top-left hand corner"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "tform. Move over to the right of the platform and as it shoots up, at the last second you want to jump slightly to the right and use that momentum to propel Madeline into that strawberry. _Don’t use your dash_, because you’ll need that for when you come down. Dash to the right onto the next conveyor platform and let that shoot you up through the spikes and onto the platform and to safety. _Phew!_\n\n[iframe](https://www.youtube.com/embed/3xZyhH8n99E?feature=oembed)\n\n### Strawberry \\#15\n\n![Celeste Strawberry 14](https://i1.wp.com/switchaboo.com/wp-content/uploads/2018/03/2018022718120300-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nIn the next frame, the strawberry is in a very awkward spot. You’ll need to be very quick and precise with this one, so try not to get discourage if it takes you three (or thirty) tries. Jump and cling on the left hand side of the conveyor platform. As it gets to the end, climb up to the right side of the wall just below the wooden plank. As the conveyor makes its wa"
      }
    ],
    "15": [
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎‎ Strawberries [x20] Missable 4, 6, 7, 8, 9, 10, 11, 12, 13, 16, 17, 19, 20 Not Missable* 1, 2, 3, 5, 14, 15, 18 ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this guide sometimes I will say: 'Do [x] to grab the strawberry' and 'Do [x] to collect the strawberry' Grabbed Grabbing a strawberry will make it float near you. It is NOT collected and wi"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "and you will see strawberry 14. It will be surrounded by spikes in a nook at the top of the screen. I've found two ways you could do this depending on what you find easier: 1. Use the lift to boost yourself the right amount to grab the strawberry 2. Or to be safe - boost off the lift (pressing jump later) to boost below the strawberry, then dashing upwards to grab it without touching the spikes. Dash to the next screen to collect the strawberry, as standing on the lifts doesn't count. \n \n \n \n \n Strawberry 15 \n \n [Not Missable] In the room after strawberry 14, you will see strawberry 15. - Ensure the lift is in the stationary position. - Fall down towards the spikes and dash upwards to grab onto the right side of the lift. - Once the lift moves you towards the strawberry, you have to quickly jump, grab onto the wall‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ to grab the berry, then quickly jump back onto the lift before it moves away. - As the lift slowly moves back, jump onto the wooden platform to collect the strawberry."
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "e top of the screen. I've found two ways you could do this depending on what you find easier: 1. Use the lift to boost yourself the right amount to grab the strawberry 2. Or to be safe - boost off the lift (pressing jump later) to boost below the strawberry, then dashing upwards to grab it without touching the spikes. Dash to the next screen to collect the strawberry, as standing on the lifts doesn't count. \n \n \n \n \n Strawberry 15 \n \n [Not Missable] In the room after strawberry 14, you will see strawberry 15. - Ensure the lift is in the stationary position. - Fall down towards the spikes and dash upwards to grab onto the right side of the lift. - Once the lift moves you towards the strawberry, you have to quickly jump, grab onto the wall‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ to grab the berry, then quickly jump back onto the lift before it moves away. - As the lift slowly moves back, jump onto the wooden platform to collect the strawberry. \n \n \n \n \n Strawberry 16 \n \n [Missable] From checkpoint 2, head towards the path"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "up and over just to drop down as the crumbling bricks fall.\n\nNow that you’re back, jump into the hidden area that we found before (just above where the sign was), make your way up and through to the next frame.\n\nNow if you look closely at this one, you can see that there is a crumbly wall in the top-left hand corner of the frame (all those years of playing Zelda has finally paid off!). Jump onto the spring and dash onto the platform. Dash into the wall and reveal another hidden area.\n\n![Celeste Strawberry 15](https://i1.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717474400-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nThis strawberry looks pretty self-explanatory, but in case you can’t figure it out, jump to the left and dash up-left, picking up the diamonds and dashing again until you get the strawberry. But don’t be in a hurry to get back, you still need to be safe on land to be rewarded with the strawberry. Cling onto the wall and wait for the diamonds to reappear and make your"
      }
    ],
    "16": [
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": ", 14, 15, 18 ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this guide sometimes I will say: 'Do [x] to grab the strawberry' and 'Do [x] to collect the strawberry' Grabbed Grabbing a strawberry will make it float near you. It is NOT collected and will return to it's original location if you die. ‎ Collected A strawberry will be collected once you touch the ground for a shor"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "Missable] In the room after strawberry 14, you will see strawberry 15. - Ensure the lift is in the stationary position. - Fall down towards the spikes and dash upwards to grab onto the right side of the lift. - Once the lift moves you towards the strawberry, you have to quickly jump, grab onto the wall‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ to grab the berry, then quickly jump back onto the lift before it moves away. - As the lift slowly moves back, jump onto the wooden platform to collect the strawberry. \n \n \n \n \n Strawberry 16 \n \n [Missable] From checkpoint 2, head towards the pathway behind the lift. Grab onto the lift to move it out of the way, then quickly dash left to get behind it and head upwards. Once in the next room, continue left - dashing over the lift on the floor. - To make your way across the next room, dash left onto the spring-pad, then dash up to land‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ safely on the wooden platform above. - Fall left to land on the platform below with the green sign, then dash to climb onto the ‎‎pl"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "ards the pathway behind the lift. Grab onto the lift to move it out of the way, then quickly dash left to get behind it and head upwards. Once in the next room, continue left - dashing over the lift on the floor. - To make your way across the next room, dash left onto the spring-pad, then dash up to land‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ safely on the wooden platform above. - Fall left to land on the platform below with the green sign, then dash to climb onto the ‎‎platform ‎ ‎ ‎ ‎above - heading left to find strawberry 16. You will see strawberry 16 at the bottom of the cliff - jump off to grab the strawberry then quickly dash up to climb up and collect the berry. To exit and continue - Head right, climbing up the left wall to land safely on the wooden platform - dashing right ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ towards the exit on the right. - Dash right over the lift on the floor and jump down the hole in the floor on the right. - Walk over the 1x1 crumbling platform above the traffic light lift to continue from checkpo"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "lift. Grab onto the lift to move it out of the way, then quickly dash left to get behind it and head upwards. Once in the next room, continue left - dashing over the lift on the floor. - To make your way across the next room, dash left onto the spring-pad, then dash up to land‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ safely on the wooden platform above. - Fall left to land on the platform below with the green sign, then dash to climb onto the ‎‎platform ‎ ‎ ‎ ‎above - heading left to find strawberry 16. You will see strawberry 16 at the bottom of the cliff - jump off to grab the strawberry then quickly dash up to climb up and collect the berry. To exit and continue - Head right, climbing up the left wall to land safely on the wooden platform - dashing right ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ towards the exit on the right. - Dash right over the lift on the floor and jump down the hole in the floor on the right. - Walk over the 1x1 crumbling platform above the traffic light lift to continue from checkpoint 2. ---------------------"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "ight lift to continue from checkpoint 2. ------------------------------------------------------------------------------------------------------- To continue to strawberry 17 and cassette Tape - Head right, climbing up the left wall to land safely on the wooden platform - dashing right ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ towards the exit to be in the room with the lift on the floor. - Continue with 'Cassette Tape' or 'Strawberry 17' in guide. \n \n \n \n \n Cassette Tape \n \n The cassette takes the same path as strawberry 16, so skip the outlined paragraph below if you're following along. From checkpoint 2, head for the path behind the traffic light lift. From the next room, use the lift to boost yourself upwards and head into the next room. There is a secret behind the lift in this room - grab onto the lift to move it out of the way then dash to get behind it to find the cassette room. Congrats you found the cassette room! In time with the beat, jump across the pink and blue platforms, then climb the left wall ont"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "o boost yourself upwards and head into the next room. There is a secret behind the lift in this room - grab onto the lift to move it out of the way then dash to get behind it to find the cassette room. Congrats you found the cassette room! In time with the beat, jump across the pink and blue platforms, then climb the left wall onto the traffic light lift and ride the lift all the way right to dash and grab the cassette. \n \n \n \n \n Strawberry 17 \n \n [Missable] Strawberry 17 takes the same path as strawberry 16 and the cassette tape, so skip outlined paragraphs below if you're following along. From checkpoint 2, head for the path behind the traffic light lift. From the next room, use the lift to boost yourself upwards and head into the next room. Once you find the next room, use the lift to boost yourself over the spikes and collect strawberry 17. To exit and continue Head down the hole to return to the lift on the floor we dashed over, then head down again to be back at checkpoint 2. \n \n \n \n \n Strawb"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "1)\n\nThis strawberry looks pretty self-explanatory, but in case you can’t figure it out, jump to the left and dash up-left, picking up the diamonds and dashing again until you get the strawberry. But don’t be in a hurry to get back, you still need to be safe on land to be rewarded with the strawberry. Cling onto the wall and wait for the diamonds to reappear and make your way back to the entrance.\n\n[iframe](https://www.youtube.com/embed/WP4Vhg-HY8w?feature=oembed)\n\n### Strawberry \\#11\n\n![Celeste Strawberry 16](https://i2.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717525100-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\n**But wait, we’re not done here yet!** Jump and grab onto the wall on the right, then jump and dash onto the floating island. Can you see the crumbling part in the wall? Dash up into it and proceed to the next area.\n\nThere are no strawberries here so proceed to the top right and through to the next frame.\n\n_There’s_ your strawberry! Fall down, dash up-right, grab ont"
      }
    ],
    "17": [
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this guide sometimes I will say: 'Do [x] to grab the strawberry' and 'Do [x] to collect the strawberry' Grabbed Grabbing a strawberry will make it float near you. It is NOT collected and will return to it's original location if you die. ‎ Collected A strawberry will be collected once you touch the ground for a short amount of ti"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "collect the berry. To exit and continue - Head right, climbing up the left wall to land safely on the wooden platform - dashing right ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ towards the exit on the right. - Dash right over the lift on the floor and jump down the hole in the floor on the right. - Walk over the 1x1 crumbling platform above the traffic light lift to continue from checkpoint 2. ------------------------------------------------------------------------------------------------------- To continue to strawberry 17 and cassette Tape - Head right, climbing up the left wall to land safely on the wooden platform - dashing right ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ towards the exit to be in the room with the lift on the floor. - Continue with 'Cassette Tape' or 'Strawberry 17' in guide. \n \n \n \n \n Cassette Tape \n \n The cassette takes the same path as strawberry 16, so skip the outlined paragraph below if you're following along. From checkpoint 2, head for the path behind the traffic light lift. From the next room, use th"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "ole in the floor on the right. - Walk over the 1x1 crumbling platform above the traffic light lift to continue from checkpoint 2. ------------------------------------------------------------------------------------------------------- To continue to strawberry 17 and cassette Tape - Head right, climbing up the left wall to land safely on the wooden platform - dashing right ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ towards the exit to be in the room with the lift on the floor. - Continue with 'Cassette Tape' or 'Strawberry 17' in guide. \n \n \n \n \n Cassette Tape \n \n The cassette takes the same path as strawberry 16, so skip the outlined paragraph below if you're following along. From checkpoint 2, head for the path behind the traffic light lift. From the next room, use the lift to boost yourself upwards and head into the next room. There is a secret behind the lift in this room - grab onto the lift to move it out of the way then dash to get behind it to find the cassette room. Congrats you found the cassette room! In"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "behind the traffic light lift. From the next room, use the lift to boost yourself upwards and head into the next room. There is a secret behind the lift in this room - grab onto the lift to move it out of the way then dash to get behind it to find the cassette room. Congrats you found the cassette room! In time with the beat, jump across the pink and blue platforms, then climb the left wall onto the traffic light lift and ride the lift all the way right to dash and grab the cassette. \n \n \n \n \n Strawberry 17 \n \n [Missable] Strawberry 17 takes the same path as strawberry 16 and the cassette tape, so skip outlined paragraphs below if you're following along. From checkpoint 2, head for the path behind the traffic light lift. From the next room, use the lift to boost yourself upwards and head into the next room. Once you find the next room, use the lift to boost yourself over the spikes and collect strawberry 17. To exit and continue Head down the hole to return to the lift on the floor we dashed over,"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "t. From the next room, use the lift to boost yourself upwards and head into the next room. There is a secret behind the lift in this room - grab onto the lift to move it out of the way then dash to get behind it to find the cassette room. Congrats you found the cassette room! In time with the beat, jump across the pink and blue platforms, then climb the left wall onto the traffic light lift and ride the lift all the way right to dash and grab the cassette. \n \n \n \n \n Strawberry 17 \n \n [Missable] Strawberry 17 takes the same path as strawberry 16 and the cassette tape, so skip outlined paragraphs below if you're following along. From checkpoint 2, head for the path behind the traffic light lift. From the next room, use the lift to boost yourself upwards and head into the next room. Once you find the next room, use the lift to boost yourself over the spikes and collect strawberry 17. To exit and continue Head down the hole to return to the lift on the floor we dashed over, then head down again to be b"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "fic light lift and ride the lift all the way right to dash and grab the cassette. \n \n \n \n \n Strawberry 17 \n \n [Missable] Strawberry 17 takes the same path as strawberry 16 and the cassette tape, so skip outlined paragraphs below if you're following along. From checkpoint 2, head for the path behind the traffic light lift. From the next room, use the lift to boost yourself upwards and head into the next room. Once you find the next room, use the lift to boost yourself over the spikes and collect strawberry 17. To exit and continue Head down the hole to return to the lift on the floor we dashed over, then head down again to be back at checkpoint 2. \n \n \n \n \n Strawberry 18 \n \n [Not Missable] From checkpoint 2, use the lift to boost yourself over the chasm. Then from the outer small wooden platform, fall so you are under strawberry 18 and quickly dash upwards to climb up and grab the strawberry. \n \n \n \n \n Strawberry 19 \n \n [Missable] From checkpoint 2, use the traffic light lift to boost yourself over"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "ll? Dash up into it and proceed to the next area.\n\nThere are no strawberries here so proceed to the top right and through to the next frame.\n\n_There’s_ your strawberry! Fall down, dash up-right, grab onto the dry wall and climb up it. Fall off the wooden platform to the right, collect the strawberry and dash between the spikes into the diamond. Dash again up-right past the spikes and there we go!\n\n[iframe](https://www.youtube.com/embed/s4Rf8nEO0YA?feature=oembed)\n\n### Strawberry \\#12\n\n![Celeste Strawberry 17](https://i2.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717554500-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nIn this next room, dash onto the side of the ice platform. As it is about to fall, jump again onto the platform on the top left. Do a leap of faith to the right and dash onto the three stones hovering. Before they come crashing down jump and dash upwards and land on that tiny little wooden plank next to the traffic lights in the background. Make your way upwards and"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "of the conveyor platform, but be sure not to jump off of it until it completely stops (otherwise you’ll be projected up into the spikes at the top). Jump off to the left and grab onto the right side of the other conveyor platform. When that stops, jump over it to the left and dash right (or grab onto the wall to the left and jump right over the spikes) just before you’re about to hit the spikes.\n\n[iframe](https://www.youtube.com/embed/rnOqvdTjPPE?feature=oembed)\n\n### Strawberry \\#13\n\n![Celeste Strawberry 17](https://i2.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717554500-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nNow make your way back to the previous frame, but do not move on as we are not done here yet! Do you see that tiny little gap at the bottom of the screen? Yep, that’s where you want to go! Jump down onto the three crumbling stones, jump to the left and time your dash to the right perfectly.\n\n![Celeste Strawberry 18](https://i2.wp.com/switchaboo.com/wp-content/uploads"
      }
    ],
    "19": [
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "e Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this guide sometimes I will say: 'Do [x] to grab the strawberry' and 'Do [x] to collect the strawberry' Grabbed Grabbing a strawberry will make it float near you. It is NOT collected and will return to it's original location if you die. ‎ Collected A strawberry will be collected once you touch the ground for a short amount of time. When you collect a straw"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "e you find the next room, use the lift to boost yourself over the spikes and collect strawberry 17. To exit and continue Head down the hole to return to the lift on the floor we dashed over, then head down again to be back at checkpoint 2. \n \n \n \n \n Strawberry 18 \n \n [Not Missable] From checkpoint 2, use the lift to boost yourself over the chasm. Then from the outer small wooden platform, fall so you are under strawberry 18 and quickly dash upwards to climb up and grab the strawberry. \n \n \n \n \n Strawberry 19 \n \n [Missable] From checkpoint 2, use the traffic light lift to boost yourself over the chasm - continuing right to find the strawberry 19 room. Once inside DON'T DASH Fall down to the lift below to boost yourself right, landing on the crumbling platform and quickly climbing towards the spring pad. Use the spring pad to grab the strawberry, then dash to land on the platform and collect the berry. \n \n \n \n \n Strawberry 20 \n \n [Missable] Continue through the level until you enter a room with spike"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "to return to the lift on the floor we dashed over, then head down again to be back at checkpoint 2. \n \n \n \n \n Strawberry 18 \n \n [Not Missable] From checkpoint 2, use the lift to boost yourself over the chasm. Then from the outer small wooden platform, fall so you are under strawberry 18 and quickly dash upwards to climb up and grab the strawberry. \n \n \n \n \n Strawberry 19 \n \n [Missable] From checkpoint 2, use the traffic light lift to boost yourself over the chasm - continuing right to find the strawberry 19 room. Once inside DON'T DASH Fall down to the lift below to boost yourself right, landing on the crumbling platform and quickly climbing towards the spring pad. Use the spring pad to grab the strawberry, then dash to land on the platform and collect the berry. \n \n \n \n \n Strawberry 20 \n \n [Missable] Continue through the level until you enter a room with spikes sticking out of the floor and three loose ice platforms. If you look towards the top-left of the screen you will see a secret passage. Cl"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "ts to the end, climb up to the right side of the wall just below the wooden plank. As the conveyor makes its way back, you’ll need to drop down and cling onto the right side of it. It’ll move back to the right again which you’ll then need to jump off to get the strawberry. Cling onto the wall and jump back onto the side of the platform. When it starts to move back, make your way up and to safety.\n\n[iframe](https://www.youtube.com/embed/IKrVSdFWC2I?feature=oembed)\n\n### Strawberry \\#16\n\n![Celeste Strawberry 19](https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022718191900-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nProceed to the next frame and do you see that strawberry to the right of screen? Let’s not worry about that one just yet… instead, jump off the first plank and dash up through the plank above. Cling on the the right side of that conveyor platform and wait for it to finish moving. Don’t let it project you, but instead quickly jump up and over the spikes so that you’re"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "(https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022718363600-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nDown below in the next frame, you’ll see a sweet sweet strawberry. Jump down and move to the right, making sure you do not use your dash to collect it as you will need it to come back up. Cling on to the side of the wall, kick back off of it and dash up back to safety.\n\n[iframe](https://www.youtube.com/embed/CEIfPiu21F0?feature=oembed)\n\n### Strawberry \\#18\n\n![Celeste Strawberry 19](https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022718191900-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nMake your way back to the frame with the conveyor platform and then go back down to where we initially started this adventure off the beaten path. Step onto the crumbling stone to the right and fall down in front of the conveyor platform. Cling onto it, project yourself over to the other side and cling onto the wall. pull yourself up onto the plank on the left hand s"
      }
    ],
    "20": [
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "int 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this guide sometimes I will say: 'Do [x] to grab the strawberry' and 'Do [x] to collect the strawberry' Grabbed Grabbing a strawberry will make it float near you. It is NOT collected and will return to it's original location if you die. ‎ Collected A strawberry will be collected once you touch the ground for a short amount of time. When you collect a strawberry it will"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "18 and quickly dash upwards to climb up and grab the strawberry. \n \n \n \n \n Strawberry 19 \n \n [Missable] From checkpoint 2, use the traffic light lift to boost yourself over the chasm - continuing right to find the strawberry 19 room. Once inside DON'T DASH Fall down to the lift below to boost yourself right, landing on the crumbling platform and quickly climbing towards the spring pad. Use the spring pad to grab the strawberry, then dash to land on the platform and collect the berry. \n \n \n \n \n Strawberry 20 \n \n [Missable] Continue through the level until you enter a room with spikes sticking out of the floor and three loose ice platforms. If you look towards the top-left of the screen you will see a secret passage. Climb up the walls and grab onto the large ice block to the left to make it fall - quickly jumping to safety before it falls. Once the block has fallen, dash into the wall where the ice block once was - this will reveal the secret passage to the strawberry. Once inside the strawberry ro"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "roceed to the next frame and do you see that strawberry to the right of screen? Let’s not worry about that one just yet… instead, jump off the first plank and dash up through the plank above. Cling on the the right side of that conveyor platform and wait for it to finish moving. Don’t let it project you, but instead quickly jump up and over the spikes so that you’re on the left hand side of it. Before it comes back to squish you, go left, jump up and proceed to the hidden area above.\n\n![Celeste Strawberry 20](https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022718261500-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nIn this part, jump onto the middle of the conveyor platform and at the last second, jump and let it project you upwards through the spikes and then dash that last bit. Make your way to the left and up to the next frame.\n\nTo get that strawberry, you’ll need to jump up, dash, and cling onto the side of the platform conveyor belt. But before making your way to that stra"
      }
    ],
    "21": [
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "nd, jump and let it project you upwards through the spikes and then dash that last bit. Make your way to the left and up to the next frame.\n\nTo get that strawberry, you’ll need to jump up, dash, and cling onto the side of the platform conveyor belt. But before making your way to that strawberry, there is ANOTHER hidden area that is revealed behind the conveyor platform that has this chapter’s B-Side Tape. For info on how to get that, we’ll have our guide up on B-Side Tapes very soon.\n\n![Celeste Strawberry 21](https://i1.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022718272500-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nNow, back to the strawberry! Jump, dash, and cling onto the conveyor platforform and jump off at the last second so that it flings you aaallllllll the way over to the other side.\n\n[iframe](https://www.youtube.com/embed/Pth-caAuurE?feature=oembed)\n\n### Strawberry \\#17\n\n![Celeste Strawberry 22](https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/201802271834040"
      }
    ],
    "22": [
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "w to get that, we’ll have our guide up on B-Side Tapes very soon.\n\n![Celeste Strawberry 21](https://i1.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022718272500-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nNow, back to the strawberry! Jump, dash, and cling onto the conveyor platforform and jump off at the last second so that it flings you aaallllllll the way over to the other side.\n\n[iframe](https://www.youtube.com/embed/Pth-caAuurE?feature=oembed)\n\n### Strawberry \\#17\n\n![Celeste Strawberry 22](https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022718340400-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nNow jump down to the previous frame, but we’re not finished with this side part yet. Make your way past the conveyor platform and go through to the left side of the screen. Jump and dash to the left onto the spring button. As that shoots you up, make your way to the left a bit and then dash again up through the plank and to safety. Jump down to the left and land on t"
      }
    ],
    "23": [
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "th this side part yet. Make your way past the conveyor platform and go through to the left side of the screen. Jump and dash to the left onto the spring button. As that shoots you up, make your way to the left a bit and then dash again up through the plank and to safety. Jump down to the left and land on the small platform that has no spikes and a sign is that’s pointing upwards. Jump off that platformto the left and dash up, cling on to the icy side of the wall and make your way up.\n\n![Celeste Strawberry 23](https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022718363600-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nDown below in the next frame, you’ll see a sweet sweet strawberry. Jump down and move to the right, making sure you do not use your dash to collect it as you will need it to come back up. Cling on to the side of the wall, kick back off of it and dash up back to safety.\n\n[iframe](https://www.youtube.com/embed/CEIfPiu21F0?feature=oembed)\n\n### Strawberry \\#18\n\n![Celeste"
      }
    ],
    "24": [
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "form. Cling onto it, project yourself over to the other side and cling onto the wall. pull yourself up onto the plank on the left hand side and take a nice deep breath. Jump up and to the left, make your way around to the right and dash upwards onto the other plank where the strawberry is.\n\n**To proceed, make sure that you go right before you go up, because once you go up, you cannot come back.**\n\n[iframe](https://www.youtube.com/embed/tXqrwr0y7ms?feature=oembed)\n\n### Strawberry \\#19\n\n![Celeste Strawberry 24](https://i1.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022720103100-75A32021BE3512D7AA96B2D72F764411-1.jpg?w=1280&ssl=1)\n\nIn here, you’ll need to walk off the plank and land on the conveyor platform. Time the jump and leap over to the crumbling stones on the bottom right hand side of the screen. Jump and cling onto the right wall and make your way up to the right floating island. Use the spring button, collect the strawberry and dash onto the middle platform. Now jump your way back to"
      }
    ],
    "25": [
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "eed to walk off the plank and land on the conveyor platform. Time the jump and leap over to the crumbling stones on the bottom right hand side of the screen. Jump and cling onto the right wall and make your way up to the right floating island. Use the spring button, collect the strawberry and dash onto the middle platform. Now jump your way back to the plank and proceed through to previous frame.\n\n[iframe](https://www.youtube.com/embed/vQxipWgjoRE?feature=oembed)\n\n### Strawberry \\#20\n\n![Celeste Strawberry 25](https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022718421800-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\n_NOW_ you can jump back up and make your way up to where the big plank is up the top. Proceed upwards…\n\nJump to the right, dash up and cling to the wall without spikes on the left. Kick off from that wall, collect the diamond and dash onto the plank to the right. Jump and dash to the left and land on the middle platform. Now jump to the left and fall until you’re jus"
      }
    ],
    "26": [
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "ur way up to where the big plank is up the top. Proceed upwards…\n\nJump to the right, dash up and cling to the wall without spikes on the left. Kick off from that wall, collect the diamond and dash onto the plank to the right. Jump and dash to the left and land on the middle platform. Now jump to the left and fall until you’re just about to hit the spikes; before you do, dash to the left and cling onto the wall. Climb up and jump onto the little platform. Then proceed further upwards.\n\n![Celeste Strawberry 26](https://i2.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022718441900-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nIn this frame, jump onto the spring button and cling onto the wall on the left. Make your way up past the spikes, jump to the right, dash and cling onto the left side of the conveyor platform. After it moves up, kick off and land on the crumbling rocks, then quickly jump to the left and dash to safety. Proceed to the left and then up.\n\n![Celeste Strawberry 27](https:"
      }
    ],
    "27": [
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "Celeste Strawberry 26](https://i2.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022718441900-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nIn this frame, jump onto the spring button and cling onto the wall on the left. Make your way up past the spikes, jump to the right, dash and cling onto the left side of the conveyor platform. After it moves up, kick off and land on the crumbling rocks, then quickly jump to the left and dash to safety. Proceed to the left and then up.\n\n![Celeste Strawberry 27](https://i2.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022718465300-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nIn this frame, jump onto the first step and the jump to the right. Dash upwards, cling onto the wall and climb upwards to the plank. If you cling onto the rectangle that seems a bit off, make sure to jump from it quickly as it’ll fall after a few seconds. This is important to remember, as there are other ones just like it. There is a hidden area to the top-left, just"
      }
    ],
    "28": [
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "sure to jump from it quickly as it’ll fall after a few seconds. This is important to remember, as there are other ones just like it. There is a hidden area to the top-left, just behind the other odd-looking rectangle. Jump and cling onto it, let it fall but jump back to safety so that you don’t go down with it. Now proceed through to the hidden area.\n\nJump and cling onto the wall on the right. Kick off and dash from one diamond to another, grabbing the last strawberry along the way.\n\n![Celeste Strawberry 28](https://i2.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022718541500-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nNow make your way back to the previous frame, make the rectangle fall again and jump and dash over to the floating island. Cling onto the right side of the rectangle and fall down with it. Jump and dash from it and proceed to the next room.\n\n[iframe](https://www.youtube.com/embed/GvMbUoWg_HY?feature=oembed)\n\nJump onto the spring button and cling onto the right side o"
      }
    ]
  },
  "mechanics": {},
  "sections": {
    "Start": [
      {
        "source_id": 1,
        "source_url": "https://celeste.ink/wiki/Forsaken_City",
        "content": "ing this chapter.\n\n## Contents\n\n- [1Plot](https://celeste.ink/celeste.ink#Plot)\n- [2Gameplay](https://celeste.ink/celeste.ink#Gameplay)\n - [2.1A-Side](https://celeste.ink/celeste.ink#A-Side)\n - [2.1.1Start](https://celeste.ink/celeste.ink#Start)\n - [2.1.2Crossing](https://celeste.ink/celeste.ink#Crossing)\n - [2.1.3Chasm](https://celeste.ink/celeste.ink#Chasm)\n - [2.2B-Side](https://celeste.ink/celeste.ink#B-Side)\n - [2.3C-Side](https://celeste.ink/celeste.ink#C-Side)\n- [3Strawberries & Collectables](https://celeste.ink/celeste.ink#Strawberries_&_Collectables)\n - [3.1Winged Golden Strawberry](https://celeste.ink/celeste.ink#Winged_Golden_Strawberry)\n- [4Speedrun strategies](https://celeste.ink/celeste.ink#Speedrun_strategies)\n\n## Plot\n\n\\[ [edit](https://celeste.ink/wiki/Forsaken_City?veaction=edit&section=1) \\| [edit source](https://celeste.ink/wiki/Forsaken_City?action=edit&section=1)\\]\n\n_For the list of dialogues, check [Forsaken City/Dialogues](https://celeste.ink/wiki/Forsaken_City/Dialogues)._\n\n**Thou hast been warned!**\n\nThis section contains spoilers for Forsaken City. Do not read the following section if you wish to avoid spoilers for Forsaken City.\n\n| Show/hide content |\n|"
      },
      {
        "source_id": 2,
        "source_url": "https://celestegame.fandom.com/wiki/Chapter_1:_Forsaken_City",
        "content": "wiki/Theo).\n\n## Contents\n\n- [1**Gameplay**](https://celestegame.fandom.com/celestegame.fandom.com#Gameplay)\n - [1.1**Objects**](https://celestegame.fandom.com/celestegame.fandom.com#Objects)\n - [1.1.1Start](https://celestegame.fandom.com/celestegame.fandom.com#Start)\n - [1.1.2Crossing](https://celestegame.fandom.com/celestegame.fandom.com#Crossing)\n - [1.1.3Chasm](https://celestegame.fandom.com/celestegame.fandom.com#Chasm)\n - [1.2**Crystal Heart**](https://celestegame.fandom.com/celestegame.fandom.com#Crystal_Heart)\n - [1.3**Alternate Sides**](https://celestegame.fandom.com/celestegame.fandom.com#Alternate_Sides)\n - [1.3.1Start](https://celestegame.fandom.com/celestegame.fandom.com#Start_2)\n - [1.3.2Contraption](https://celestegame.fandom.com/celestegame.fandom.com#Contraption)\n - [1.3.3Scrap Pit](https://celestegame.fandom.com/celestegame.fandom.com#Scrap_Pit)\n - [1.3.4Forsaken City C-Side](https://celestegame.fandom.com/celestegame.fandom.com#Forsaken_City_C-Side)\n - [1.4**Winged Golden Strawberry**](https://celestegame.fandom.com/celestegame.fandom.com#Winged_Golden_Strawberry)\n- [2**Plot**](https://celestegame.fandom.com/celestegame.fandom.com#Plot)\n- [3**Speedrunning Record P"
      },
      {
        "source_id": 3,
        "source_url": "https://www.ign.com/wikis/celeste/Chapter_1-_Forsaken_City",
        "content": "ppens to be a dense level, packed with collectibles and secret rooms.\n\nBelow is a list of all 20 strawberries for this level, as well as the locations for the cassette tape and the Crystal Heart.\n\n## Start\n\n### Strawberry \\#1\n\nThe first strawberry is right out in the open on the second screen of the chapter. Use the spring to gain height and dash into the strawberry. Touch the ground to lock it in!\n\n### Strawberry \\#2\n\nOn the screen immediately after the first strawberry is the second! Drop down from the platform above the fruit to grab it and dash into the wall to recover. Climb and wall jump back up to safety!\n\n### Strawberry \\#3\n\nThis strawberry is the first flying strawberry you see. You cannot dash on this screen or you’ll scare it away. Use the platforms on the right to get above the flying fruit and drop down to collect it.\n\n### Strawberry \\#4\n\nThe screen above the flying strawberry, go to the room on the left with the glowing light first. Jump and dash upward to make it to the landing in the middle. You can grab the wall if you need to climb up. Using the spring, hop over the spikes and fall gracefully downward, using your dash to collect the strawberry and land safely.\n\n##"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "10, 11, 12, 13, 16, 17, 19, 20 Not Missable* 1, 2, 3, 5, 14, 15, 18 ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this guide sometimes I will say: 'Do [x] to grab the strawberry' and 'Do [x] to collect the strawberry' Grabbed Grabbing a strawberry will make it float near you. It is NOT collected and will return to it's original location if you die. ‎ Collected A strawberry will be collected once you touch the ground for a short amount of time. When you collect a strawberry it will disappear with a flash showing '1000' (like‎ arcade‎ points) and will also"
      },
      {
        "source_id": 5,
        "source_url": "https://celestegame.fandom.com/wiki/Chapter_1:_Forsaken_City",
        "content": "wiki/Theo).\n\n## Contents\n\n- [1**Gameplay**](https://celestegame.fandom.com/celestegame.fandom.com#Gameplay)\n - [1.1**Objects**](https://celestegame.fandom.com/celestegame.fandom.com#Objects)\n - [1.1.1Start](https://celestegame.fandom.com/celestegame.fandom.com#Start)\n - [1.1.2Crossing](https://celestegame.fandom.com/celestegame.fandom.com#Crossing)\n - [1.1.3Chasm](https://celestegame.fandom.com/celestegame.fandom.com#Chasm)\n - [1.2**Crystal Heart**](https://celestegame.fandom.com/celestegame.fandom.com#Crystal_Heart)\n - [1.3**Alternate Sides**](https://celestegame.fandom.com/celestegame.fandom.com#Alternate_Sides)\n - [1.3.1Start](https://celestegame.fandom.com/celestegame.fandom.com#Start_2)\n - [1.3.2Contraption](https://celestegame.fandom.com/celestegame.fandom.com#Contraption)\n - [1.3.3Scrap Pit](https://celestegame.fandom.com/celestegame.fandom.com#Scrap_Pit)\n - [1.3.4Forsaken City C-Side](https://celestegame.fandom.com/celestegame.fandom.com#Forsaken_City_C-Side)\n - [1.4**Winged Golden Strawberry**](https://celestegame.fandom.com/celestegame.fandom.com#Winged_Golden_Strawberry)\n- [2**Plot**](https://celestegame.fandom.com/celestegame.fandom.com#Plot)\n- [3**Speedrunning Record P"
      },
      {
        "source_id": 6,
        "source_url": "https://www.neoseeker.com/celeste/walkthrough/Level_1_-_Forsaken_City",
        "content": "https://cdn.staticneo.com/ew/5/5e/Forsaken-CityTop-Banner.gif)](https://www.neoseeker.com/celeste/File:Forsaken-CityTop-Banner.gif)[iframe](https://www.youtube.com/embed/iFY6aP4ACA0?wmode=transparent&start=)\n\nWhen you are first starting out, it's a good idea to take a moment to familiarize yourself with the game's [basic controls](https://www.neoseeker.com/celeste/Celeste_Basic_Controls). Specific traps and items that appear in each level will be listed in the section for that level, but it is assumed that you are familiar with the basic controls in these descriptions.\n\nTraps and Tools in this level\n\n**Spikes**\n\n[![Celeste Spikes.jpg](https://cdn.staticneo.com/ew/e/ec/Celeste_Spikes.jpg)](https://www.neoseeker.com/celeste/File:Celeste_Spikes.jpg)\n\n\\- Advertisement -\n\nThe idea of spikes is pretty obvious. If you touch them, they kill you. Don't touch them. Spikes can show up on the floors, the walls, or the ceilings - and sometimes on moving objects.\n\nDealing with spikes while going through this level is fairly simple and straightforward, but spikes are actually a somewhat complex hazard. There are places where you can hang off of the edge of a row of spikes where you would expect t"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "cling onto the right side of it. It’ll move back to the right again which you’ll then need to jump off to get the strawberry. Cling onto the wall and jump back onto the side of the platform. When it starts to move back, make your way up and to safety.\n\n[iframe](https://www.youtube.com/embed/IKrVSdFWC2I?feature=oembed)\n\n### Strawberry \\#16\n\n![Celeste Strawberry 19](https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022718191900-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nProceed to the next frame and do you see that strawberry to the right of screen? Let’s not worry about that one just yet… instead, jump off the first plank and dash up through the plank above. Cling on the the right side of that conveyor platform and wait for it to finish moving. Don’t let it project you, but instead quickly jump up and over the spikes so that you’re on the left hand side of it. Before it comes back to squish you, go left, jump up and proceed to the hidden area above.\n\n![Celeste Strawberry 20](https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022718261500-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nIn this part, jump onto the middle of the conveyor platfor"
      },
      {
        "source_id": 8,
        "source_url": "https://www.trueachievements.com/game/Celeste/walkthrough/3",
        "content": "hievements.com/game/Celeste/price)\n\n_Page index_ _Achievements_\n\n# 3\\. Celeste Chapter 1 - Forsaken City![Update notes](https://www.trueachievements.com/images/icons/storyadd.png)\n\n#### **Tutorial**\n\nStart the game, with assist mode on, and play through the first scene until you learn to dash. You can skip cutscenes by pausing the game and selecting skip scene, however I recommend to follow along with the story.\n\n[![CH1](https://www.trueachievements.com/customimages/l/111015.jpg)](https://www.trueachievements.com/customimages/111015.jpg)\n\n#### **Chapter** **1 - Forsaken City**\n\nCollectibles\n\n- 20 Strawberries\n- 1 Hidden Tape\n- 1 Crystal Heart\n\nAt the start of the level, pause the game and go to Assist Options.\n\n- Infinite Stamina - On\n- Air Dashes - Infinite\n- Invincibility - On\n\nNow you can basically fly with air dashes and not die.\n\n- Go up one screen\n- Grab the Strawberry by dashing straight up with ![cn_B](https://www.trueachievements.com/images/controllerbuttons/Xbox%20One/cn_B.png) or ![cn_X](https://www.trueachievements.com/images/controllerbuttons/Xbox%20One/cn_X.png)**(1/20 Strawberries)**\n- Go up one screen\n- Grab the Strawberry above the spikes in the right corner **(2/2"
      }
    ],
    "Crossing": [
      {
        "source_id": 1,
        "source_url": "https://celeste.ink/wiki/Forsaken_City",
        "content": "te.ink/celeste.ink#Plot)\n- [2Gameplay](https://celeste.ink/celeste.ink#Gameplay)\n - [2.1A-Side](https://celeste.ink/celeste.ink#A-Side)\n - [2.1.1Start](https://celeste.ink/celeste.ink#Start)\n - [2.1.2Crossing](https://celeste.ink/celeste.ink#Crossing)\n - [2.1.3Chasm](https://celeste.ink/celeste.ink#Chasm)\n - [2.2B-Side](https://celeste.ink/celeste.ink#B-Side)\n - [2.3C-Side](https://celeste.ink/celeste.ink#C-Side)\n- [3Strawberries & Collectables](https://celeste.ink/celeste.ink#Strawberries_&_Collectables)\n - [3.1Winged Golden Strawberry](https://celeste.ink/celeste.ink#Winged_Golden_Strawberry)\n- [4Speedrun strategies](https://celeste.ink/celeste.ink#Speedrun_strategies)\n\n## Plot\n\n\\[ [edit](https://celeste.ink/wiki/Forsaken_City?veaction=edit&section=1) \\| [edit source](https://celeste.ink/wiki/Forsaken_City?action=edit&section=1)\\]\n\n_For the list of dialogues, check [Forsaken City/Dialogues](https://celeste.ink/wiki/Forsaken_City/Dialogues)._\n\n**Thou hast been warned!**\n\nThis section contains spoilers for Forsaken City. Do not read the following section if you wish to avoid spoilers for Forsaken City.\n\n| Show/hide content |\n| --- |\n| After crossing the collapsing [bridge](https://"
      },
      {
        "source_id": 2,
        "source_url": "https://celestegame.fandom.com/wiki/Chapter_1:_Forsaken_City",
        "content": "lestegame.fandom.com#Gameplay)\n - [1.1**Objects**](https://celestegame.fandom.com/celestegame.fandom.com#Objects)\n - [1.1.1Start](https://celestegame.fandom.com/celestegame.fandom.com#Start)\n - [1.1.2Crossing](https://celestegame.fandom.com/celestegame.fandom.com#Crossing)\n - [1.1.3Chasm](https://celestegame.fandom.com/celestegame.fandom.com#Chasm)\n - [1.2**Crystal Heart**](https://celestegame.fandom.com/celestegame.fandom.com#Crystal_Heart)\n - [1.3**Alternate Sides**](https://celestegame.fandom.com/celestegame.fandom.com#Alternate_Sides)\n - [1.3.1Start](https://celestegame.fandom.com/celestegame.fandom.com#Start_2)\n - [1.3.2Contraption](https://celestegame.fandom.com/celestegame.fandom.com#Contraption)\n - [1.3.3Scrap Pit](https://celestegame.fandom.com/celestegame.fandom.com#Scrap_Pit)\n - [1.3.4Forsaken City C-Side](https://celestegame.fandom.com/celestegame.fandom.com#Forsaken_City_C-Side)\n - [1.4**Winged Golden Strawberry**](https://celestegame.fandom.com/celestegame.fandom.com#Winged_Golden_Strawberry)\n- [2**Plot**](https://celestegame.fandom.com/celestegame.fandom.com#Plot)\n- [3**Speedrunning Record Progression**](https://celestegame.fandom.com/celestegame.fandom.com#Speedrunn"
      },
      {
        "source_id": 3,
        "source_url": "https://www.ign.com/wikis/celeste/Chapter_1-_Forsaken_City",
        "content": "berry’s location. Drop through the spikes and dash to the geared platform. Ride it and jump off toward the strawberry. Catch a ride back and dash through the floor above to safely clear the room.\n\n## Crossing\n\n### Strawberry \\#7\n\nThis strawberry is in a room above the character Theo. To find Theo, go left from the room with a green crystal in the center. Jump and dash diagonally to the left to hit the green crystal in this new room and dash again to make it to safe ground. Climb up the wall on the left to find a hidden area.\n\nWatch out for the spring on the ground beneath the spikes! Hop over the hazard and use the second spring to launch toward the wall. Grab it and jump over the spikes toward the green crystal. Dash toward safety and the strawberry. Drop down the passage on the left to see Theo.\n\n### Strawberry \\#8\n\nBack in the room with the green crystal in the center (Reference photo above in Strawberry #7), make your way to the right. Climb up and dash above the crystal so you fall on it to regain your dash. Before hitting the spikes, dash to the right on safe ground. Instead of jumping up, dash through the brown rock to find a hidden strawberry.\n\n### Strawberry \\#9\n\nIn the ro"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "lieve ♡ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ \n \n \n \n \n Chapter Overview \n \n ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Crystal Heart Checkpoint 1 ‎Crossing‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎‎ Strawberries [x20] Missable 4, 6, 7, 8, 9, 10, 11, 12, 13, 16, 17, 19, 20 Not Missable* 1, 2, 3, 5, 14, 15, 18 ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this guide sometimes I will say: 'Do [x] to grab the strawberry' and 'Do [x] to collect the strawberry' Grabbed Grabbing a strawberr"
      },
      {
        "source_id": 5,
        "source_url": "https://celestegame.fandom.com/wiki/Chapter_1:_Forsaken_City",
        "content": "lestegame.fandom.com#Gameplay)\n - [1.1**Objects**](https://celestegame.fandom.com/celestegame.fandom.com#Objects)\n - [1.1.1Start](https://celestegame.fandom.com/celestegame.fandom.com#Start)\n - [1.1.2Crossing](https://celestegame.fandom.com/celestegame.fandom.com#Crossing)\n - [1.1.3Chasm](https://celestegame.fandom.com/celestegame.fandom.com#Chasm)\n - [1.2**Crystal Heart**](https://celestegame.fandom.com/celestegame.fandom.com#Crystal_Heart)\n - [1.3**Alternate Sides**](https://celestegame.fandom.com/celestegame.fandom.com#Alternate_Sides)\n - [1.3.1Start](https://celestegame.fandom.com/celestegame.fandom.com#Start_2)\n - [1.3.2Contraption](https://celestegame.fandom.com/celestegame.fandom.com#Contraption)\n - [1.3.3Scrap Pit](https://celestegame.fandom.com/celestegame.fandom.com#Scrap_Pit)\n - [1.3.4Forsaken City C-Side](https://celestegame.fandom.com/celestegame.fandom.com#Forsaken_City_C-Side)\n - [1.4**Winged Golden Strawberry**](https://celestegame.fandom.com/celestegame.fandom.com#Winged_Golden_Strawberry)\n- [2**Plot**](https://celestegame.fandom.com/celestegame.fandom.com#Plot)\n- [3**Speedrunning Record Progression**](https://celestegame.fandom.com/celestegame.fandom.com#Speedrunn"
      },
      {
        "source_id": 6,
        "source_url": "https://www.neoseeker.com/celeste/walkthrough/Level_1_-_Forsaken_City",
        "content": "rry.png)](https://www.neoseeker.com/celeste/File:Celeste_Strawberry.png) There are 20 Strawberries hidden in the Forsaken City. There are six in the starting area, 9 in the middle section, called the Crossing, and 5 in the final section - the Chasm. You can find these strawberries by looking at the maps provided, or by watching the Strawberry video.\n\n* * *\n\n[![Celeste Cassette.png](https://cdn.staticneo.com/ew/c/cf/Celeste_Cassette.png)](https://www.neoseeker.com/celeste/File:Celeste_Cassette.png) The location of the B-Side Cassette is found near the beginning of the Chasm section - the final section of the Forsaken City\n\n* * *\n\n[![Celeste Crystal Heart.png](https://cdn.staticneo.com/ew/thumb/4/44/Celeste_Crystal_Heart.png/130px-Celeste_Crystal_Heart.png)](https://www.neoseeker.com/celeste/File:Celeste_Crystal_Heart.png) The Crystal Heart for this section is hidden near the Satellite in the second section. You have to watch the color pattern being broadcast over the satellite. There are birds flying around nearby, and they fly out in various directions. You need to dash in the direction of the color of birds, following the color pattern broadcast by the Satellite. When you dash in"
      }
    ],
    "Chasm": [
      {
        "source_id": 1,
        "source_url": "https://celeste.ink/wiki/Forsaken_City",
        "content": "leste.ink#Gameplay)\n - [2.1A-Side](https://celeste.ink/celeste.ink#A-Side)\n - [2.1.1Start](https://celeste.ink/celeste.ink#Start)\n - [2.1.2Crossing](https://celeste.ink/celeste.ink#Crossing)\n - [2.1.3Chasm](https://celeste.ink/celeste.ink#Chasm)\n - [2.2B-Side](https://celeste.ink/celeste.ink#B-Side)\n - [2.3C-Side](https://celeste.ink/celeste.ink#C-Side)\n- [3Strawberries & Collectables](https://celeste.ink/celeste.ink#Strawberries_&_Collectables)\n - [3.1Winged Golden Strawberry](https://celeste.ink/celeste.ink#Winged_Golden_Strawberry)\n- [4Speedrun strategies](https://celeste.ink/celeste.ink#Speedrun_strategies)\n\n## Plot\n\n\\[ [edit](https://celeste.ink/wiki/Forsaken_City?veaction=edit&section=1) \\| [edit source](https://celeste.ink/wiki/Forsaken_City?action=edit&section=1)\\]\n\n_For the list of dialogues, check [Forsaken City/Dialogues](https://celeste.ink/wiki/Forsaken_City/Dialogues)._\n\n**Thou hast been warned!**\n\nThis section contains spoilers for Forsaken City. Do not read the following section if you wish to avoid spoilers for Forsaken City.\n\n| Show/hide content |\n| --- |\n| After crossing the collapsing [bridge](https://celeste.ink/wiki/Entities#Bridge) and narrowly escaping death"
      },
      {
        "source_id": 2,
        "source_url": "https://celestegame.fandom.com/wiki/Chapter_1:_Forsaken_City",
        "content": "elestegame.fandom.com#Objects)\n - [1.1.1Start](https://celestegame.fandom.com/celestegame.fandom.com#Start)\n - [1.1.2Crossing](https://celestegame.fandom.com/celestegame.fandom.com#Crossing)\n - [1.1.3Chasm](https://celestegame.fandom.com/celestegame.fandom.com#Chasm)\n - [1.2**Crystal Heart**](https://celestegame.fandom.com/celestegame.fandom.com#Crystal_Heart)\n - [1.3**Alternate Sides**](https://celestegame.fandom.com/celestegame.fandom.com#Alternate_Sides)\n - [1.3.1Start](https://celestegame.fandom.com/celestegame.fandom.com#Start_2)\n - [1.3.2Contraption](https://celestegame.fandom.com/celestegame.fandom.com#Contraption)\n - [1.3.3Scrap Pit](https://celestegame.fandom.com/celestegame.fandom.com#Scrap_Pit)\n - [1.3.4Forsaken City C-Side](https://celestegame.fandom.com/celestegame.fandom.com#Forsaken_City_C-Side)\n - [1.4**Winged Golden Strawberry**](https://celestegame.fandom.com/celestegame.fandom.com#Winged_Golden_Strawberry)\n- [2**Plot**](https://celestegame.fandom.com/celestegame.fandom.com#Plot)\n- [3**Speedrunning Record Progression**](https://celestegame.fandom.com/celestegame.fandom.com#Speedrunning_Record_Progression)\n- [4**Quotes**](https://celestegame.fandom.com/celestegame."
      },
      {
        "source_id": 3,
        "source_url": "https://www.ign.com/wikis/celeste/Chapter_1-_Forsaken_City",
        "content": "to grab onto the geared platform, this time on its right-hand side. When it stops, jump off to grab the strawberry and then quickly wall jump back. Jump up to solid ground and lock in the fruit.\n\n## Chasm\n\n### Strawberry \\#16\n\nTo find the next couple of strawberries, you’ll need to get behind the geared platform in the open room. Grab onto it, ride it to a stop, then hop and dash over it to slip behind it into this new area.\n\nSkip over the geared platform in the floor and continue to the left. In the next room, use the blade of grass as a marker for how long your dash is. Dash to the spring on the floor and use its lift to safely dash to the wooden platform above. Drop down to the ledge with the green sign and then climb out of this room.\n\nOutside is the strawberry. Drop down to get it and then climb back up the wall to get to solid ground.\n\n### Cassette Tape\n\nBack in the room with the geared platform in the floor, use its upward momentum to fling you to the ground above. Head into the next room to find a geared platform in the wall. Before using it to get the tantalizing strawberry on the right, activate it and sneak into the room behind it that is emitting a glow.\n\nThis is a cas"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎ ‎‎ ‎ ‎ ‎‎ Strawberries [x20] Missable 4, 6, 7, 8, 9, 10, 11, 12, 13, 16, 17, 19, 20 Not Missable* 1, 2, 3, 5, 14, 15, 18 ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Checkpoint 2 Chasm ‎ *Is visible during normal level progression and not hidden in a side-room Start Strawberry 1 Strawberry 2 Strawberry 3 Strawberry 4 Strawberry 5 Strawberry 6 Checkpoint 1 Crossing Crystal Heart Strawberry 7 Strawberry 8 Strawberry 9 Strawberry 10 Strawberry 11 Strawberry 12 Strawberry 13 Strawberry 14 Strawberry 15 Checkpoint 2 Chasm ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ Cassette Tape Strawberry 16 Strawberry 17 Strawberry 18 Strawberry 19 Strawberry 20 In Celeste, you have to touch the ground or complete a room to definitively collect the strawberries. So for clarification, in this guide sometimes I will say: 'Do [x] to grab the strawberry' and 'Do [x] to collect the strawberry' Grabbed Grabbing a strawberry will make it float near you. It is NOT collected and will return to it's original location if you die. ‎ Collected A strawberry will be collected once you touch the ground for a short amount of time. When you collect a strawberry i"
      },
      {
        "source_id": 5,
        "source_url": "https://celestegame.fandom.com/wiki/Chapter_1:_Forsaken_City",
        "content": "elestegame.fandom.com#Objects)\n - [1.1.1Start](https://celestegame.fandom.com/celestegame.fandom.com#Start)\n - [1.1.2Crossing](https://celestegame.fandom.com/celestegame.fandom.com#Crossing)\n - [1.1.3Chasm](https://celestegame.fandom.com/celestegame.fandom.com#Chasm)\n - [1.2**Crystal Heart**](https://celestegame.fandom.com/celestegame.fandom.com#Crystal_Heart)\n - [1.3**Alternate Sides**](https://celestegame.fandom.com/celestegame.fandom.com#Alternate_Sides)\n - [1.3.1Start](https://celestegame.fandom.com/celestegame.fandom.com#Start_2)\n - [1.3.2Contraption](https://celestegame.fandom.com/celestegame.fandom.com#Contraption)\n - [1.3.3Scrap Pit](https://celestegame.fandom.com/celestegame.fandom.com#Scrap_Pit)\n - [1.3.4Forsaken City C-Side](https://celestegame.fandom.com/celestegame.fandom.com#Forsaken_City_C-Side)\n - [1.4**Winged Golden Strawberry**](https://celestegame.fandom.com/celestegame.fandom.com#Winged_Golden_Strawberry)\n- [2**Plot**](https://celestegame.fandom.com/celestegame.fandom.com#Plot)\n- [3**Speedrunning Record Progression**](https://celestegame.fandom.com/celestegame.fandom.com#Speedrunning_Record_Progression)\n- [4**Quotes**](https://celestegame.fandom.com/celestegame."
      },
      {
        "source_id": 6,
        "source_url": "https://www.neoseeker.com/celeste/walkthrough/Level_1_-_Forsaken_City",
        "content": "/File:Celeste_Strawberry.png) There are 20 Strawberries hidden in the Forsaken City. There are six in the starting area, 9 in the middle section, called the Crossing, and 5 in the final section - the Chasm. You can find these strawberries by looking at the maps provided, or by watching the Strawberry video.\n\n* * *\n\n[![Celeste Cassette.png](https://cdn.staticneo.com/ew/c/cf/Celeste_Cassette.png)](https://www.neoseeker.com/celeste/File:Celeste_Cassette.png) The location of the B-Side Cassette is found near the beginning of the Chasm section - the final section of the Forsaken City\n\n* * *\n\n[![Celeste Crystal Heart.png](https://cdn.staticneo.com/ew/thumb/4/44/Celeste_Crystal_Heart.png/130px-Celeste_Crystal_Heart.png)](https://www.neoseeker.com/celeste/File:Celeste_Crystal_Heart.png) The Crystal Heart for this section is hidden near the Satellite in the second section. You have to watch the color pattern being broadcast over the satellite. There are birds flying around nearby, and they fly out in various directions. You need to dash in the direction of the color of birds, following the color pattern broadcast by the Satellite. When you dash in the proper six directions the heart will be"
      }
    ]
  },
  "collectibles": {
    "crystal_heart": [
      {
        "source_id": 1,
        "source_url": "https://celeste.ink/wiki/Forsaken_City",
        "content": "as an introductory level to much of how the game works. Madeline, controlled by the player, is introduced to combining jumping, dashing, and climbing to make it through various rooms while avoiding spikes and bottomless pits. Strawberries, [cassette tapes](https://celeste.ink/wiki/Cassette_tape), [crystal hearts](https://celeste.ink/wiki/Crystal_heart), dash-refilling crystals, and many other [entities](https://celeste.ink/wiki/Entities) are all introduced here.\n\nThree subchapters are present: Start, Crossing, and Chasm.\n\n#### Start\n\n\\[ [edit](https://celeste.ink/wiki/Forsaken_City?veaction=edit&section=4) \\| [edit source](https://celeste.ink/wiki/Forsaken_City?action=edit&section=4)\\]\n\nThe beginning of the Start checkpoint introduces the player to several basic mechanics with dashes. The second room introduces [springs](https://celeste.ink/wiki/Springs) wall jumping, which occurs when Madeline jumps from one wall to another; it is the simplest way to climb without using [stamina](htt"
      },
      {
        "source_id": 2,
        "source_url": "https://celestegame.fandom.com/wiki/Chapter_1:_Forsaken_City",
        "content": "elestegame.fandom.com/celestegame.fandom.com#Objects)\n - [1.1.1Start](https://celestegame.fandom.com/celestegame.fandom.com#Start)\n - [1.1.2Crossing](https://celestegame.fandom.com/celestegame.fandom.com#Crossing)\n - [1.1.3Chasm](https://celestegame.fandom.com/celestegame.fandom.com#Chasm)\n - [1.2**Crystal Heart**](https://celestegame.fandom.com/celestegame.fandom.com#Crystal_Heart)\n - [1.3**Alternate Sides**](https://celestegame.fandom.com/celestegame.fandom.com#Alternate_Sides)\n - [1.3.1Start](https://celestegame.fandom.com/celestegame.fandom.com#Start_2)\n - [1.3.2Contraption](https://celestegame.fandom.com/celestegame.fandom.com#Contraption)\n - [1.3.3Scrap Pit](https://celestegame.fandom.com/celestegame.fandom.com#Scrap_Pit)\n - [1.3.4Forsaken City C-Side](https://celestegame.fandom.com/celestegame.fandom.com#Forsaken_City_C-Side)\n - [1.4**Winged Golden Strawberry**](https://celestegame.fandom.com/celestegame.fandom.com#Winged_Golden_Strawberry)\n- [2**Plot**](https://celestegame.fand"
      },
      {
        "source_id": 3,
        "source_url": "https://www.ign.com/wikis/celeste/Chapter_1-_Forsaken_City",
        "content": "asics of maneuvering and maintaining enough stamina, wile using the environment to the best of your ability. It also happens to be a dense level, packed with collectibles and secret rooms.\n\nBelow is a list of all 20 strawberries for this level, as well as the locations for the cassette tape and the Crystal Heart.\n\n## Start\n\n### Strawberry \\#1\n\nThe first strawberry is right out in the open on the second screen of the chapter. Use the spring to gain height and dash into the strawberry. Touch the ground to lock it in!\n\n### Strawberry \\#2\n\nOn the screen immediately after the first strawberry is the second! Drop down from the platform above the fruit to grab it and dash into the wall to recover. Climb and wall jump back up to safety!\n\n### Strawberry \\#3\n\nThis strawberry is the first flying strawberry you see. You cannot dash on this screen or you’ll scare it away. Use the platforms on the right to get above the flying fruit and drop down to collect it.\n\n### Strawberry \\#4\n\nThe screen above"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "Celeste \n \n \n \n \n \n \n 101 ratings \n \n \n \n \n Chapter 1: Forsaken City - Complete Walkthrough [All Strawberries, Cassette Tape, and Crystal Heart] \n A GIF-guided walkthrough for collecting all strawberries, Cassette Tape, and Crystal Heart in 'Celeste - Chapter 1: Forsaken City' including video walkthrough and chapter map •⩊• \n \n \n \n \n \n Introduction \n \n ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ Hello ~ (・ω・)ﾉ This is a guide for all strawberries, Cassette Tape, and Crystal Heart in: 'Celeste: Chapter 1 - Forsaken City', Feel free to leave a comment, thumbs up, and check out my walkthrough video! - Abbilieve ♡ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ \n \n \n \n \n Chapter Overview \n \n ‎ ‎ ‎ ‎ ‎ ‎‎ ‎ ‎‎ ‎ ‎ ‎ ‎ ‎"
      },
      {
        "source_id": 5,
        "source_url": "https://celestegame.fandom.com/wiki/Chapter_1:_Forsaken_City",
        "content": "elestegame.fandom.com/celestegame.fandom.com#Objects)\n - [1.1.1Start](https://celestegame.fandom.com/celestegame.fandom.com#Start)\n - [1.1.2Crossing](https://celestegame.fandom.com/celestegame.fandom.com#Crossing)\n - [1.1.3Chasm](https://celestegame.fandom.com/celestegame.fandom.com#Chasm)\n - [1.2**Crystal Heart**](https://celestegame.fandom.com/celestegame.fandom.com#Crystal_Heart)\n - [1.3**Alternate Sides**](https://celestegame.fandom.com/celestegame.fandom.com#Alternate_Sides)\n - [1.3.1Start](https://celestegame.fandom.com/celestegame.fandom.com#Start_2)\n - [1.3.2Contraption](https://celestegame.fandom.com/celestegame.fandom.com#Contraption)\n - [1.3.3Scrap Pit](https://celestegame.fandom.com/celestegame.fandom.com#Scrap_Pit)\n - [1.3.4Forsaken City C-Side](https://celestegame.fandom.com/celestegame.fandom.com#Forsaken_City_C-Side)\n - [1.4**Winged Golden Strawberry**](https://celestegame.fandom.com/celestegame.fandom.com#Winged_Golden_Strawberry)\n- [2**Plot**](https://celestegame.fand"
      },
      {
        "source_id": 6,
        "source_url": "https://www.neoseeker.com/celeste/walkthrough/Level_1_-_Forsaken_City",
        "content": "atform.jpg)\nWood jump-throughs allow you to jump up through them, but you cannot pass through them going downward. They are often used to create points of no return between areas where you'll jump up through a wood jump-through, but won't be able to return back down the way you came.\n\n* * *\n\n**Dash Crystals**\n\n[![Celeste Energy Crystal.jpg](https://cdn.staticneo.com/ew/c/c9/Celeste_Energy_Crystal.jpg)](https://www.neoseeker.com/celeste/File:Celeste_Energy_Crystal.jpg)\nWhen you touch an dash crystal it will burst and will restore your dash and stamina. These crystals are invariably involved in some type of jumping puzzle, where you'll need to jump into them to restore your dash and then dash to safety (or to another dash crystal) before you land. Dash crystals will respawn after a few seconds.\n\n* * *\n\n**Falling Blocks**\n\n[![Celeste Loose Rocks.jpg](https://cdn.staticneo.com/ew/2/24/Celeste_Loose_Rocks.jpg)](https://www.neoseeker.com/celeste/File:Celeste_Loose_Rocks.jpg)\nIn this level, f"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "2717423300-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nJump and dash from one platform to another and make your way to the strawberry next to the computer. And watch the pretty birds (ooh, pretty!). Actually, you really do need to watch the pretty birds, as this is how to get this chapter’s Crystal Heart. We’ll have our full Crystal Heart guide up very soon.\n\n[iframe](https://www.youtube.com/embed/gS9NjlMTi5Q?feature=oembed)\n\n### Strawberry \\#10\n\n![Celeste Strawberry 14](https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022717461000-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nGo back the way you came and in the next frame, go up and over just to drop down as the crumbling bricks fall.\n\nNow that you’re back, jump into the hidden area that we found before (just above where the sign was), make your way up and through to the next frame.\n\nNow if you look closely at this one, you can see that there is a crumbly wall in the top-left hand corner of the frame (all"
      },
      {
        "source_id": 8,
        "source_url": "https://www.trueachievements.com/game/Celeste/walkthrough/3",
        "content": "and selecting skip scene, however I recommend to follow along with the story.\n\n[![CH1](https://www.trueachievements.com/customimages/l/111015.jpg)](https://www.trueachievements.com/customimages/111015.jpg)\n\n#### **Chapter** **1 - Forsaken City**\n\nCollectibles\n\n- 20 Strawberries\n- 1 Hidden Tape\n- 1 Crystal Heart\n\nAt the start of the level, pause the game and go to Assist Options.\n\n- Infinite Stamina - On\n- Air Dashes - Infinite\n- Invincibility - On\n\nNow you can basically fly with air dashes and not die.\n\n- Go up one screen\n- Grab the Strawberry by dashing straight up with ![cn_B](https://www.trueachievements.com/images/controllerbuttons/Xbox%20One/cn_B.png) or ![cn_X](https://www.trueachievements.com/images/controllerbuttons/Xbox%20One/cn_X.png)**(1/20 Strawberries)**\n- Go up one screen\n- Grab the Strawberry above the spikes in the right corner **(2/20 Strawberries)**\n- Go up two screens\n- Don't use dash here or the Strawberry may fly away. Use the platforms, grab the wall with ![cn_RT"
      }
    ],
    "cassette_tape": [
      {
        "source_id": 1,
        "source_url": "https://celeste.ink/wiki/Forsaken_City",
        "content": "ps://celeste.ink/wiki/1C) |\n\nForsaken City's A-Side serves as an introductory level to much of how the game works. Madeline, controlled by the player, is introduced to combining jumping, dashing, and climbing to make it through various rooms while avoiding spikes and bottomless pits. Strawberries, [cassette tapes](https://celeste.ink/wiki/Cassette_tape), [crystal hearts](https://celeste.ink/wiki/Crystal_heart), dash-refilling crystals, and many other [entities](https://celeste.ink/wiki/Entities) are all introduced here.\n\nThree subchapters are present: Start, Crossing, and Chasm.\n\n#### Start\n\n\\[ [edit](https://celeste.ink/wiki/Forsaken_City?veaction=edit&section=4) \\| [edit source](https://celeste.ink/wiki/Forsaken_City?action=edit&section=4)\\]\n\nThe beginning of the Start checkpoint introduces the player to several basic mechanics with dashes. The second room introduces [springs](https://celeste.ink/wiki/Springs) wall jumping, which occurs when Madeline jumps from one wall to another; i"
      },
      {
        "source_id": 2,
        "source_url": "https://celestegame.fandom.com/wiki/Chapter_1:_Forsaken_City",
        "content": "kes\n- [Dash Crystals](https://celestegame.fandom.com/wiki/Dash_Crystals)\n- Smashable Walls\n- Springs\n- Disappearing Platforms\n- Traffic Light Blocks\n- [Falling Platforms](https://celestegame.fandom.com/wiki/Falling_Platforms)\n\n#### [Chasm](https://celestegame.fandom.com/wiki/Chasm)\\[\\]\n\nThe [B-Side Cassette Tape](https://celestegame.fandom.com/wiki/Cassette_Guide) for the chapter is located here.\n\n- Traffic Light Blocks\n- Spikes\n- Disappearing Platforms\n- Springs\n- [Cassette Blocks](https://celestegame.fandom.com/wiki/Cassette_Blocks)\n- Dash Crystals\n- Falling Platforms\n\n### **Crystal Heart**\\[\\]\n\n_Main article: [Crystal Hearts Guide](https://celestegame.fandom.com/wiki/Crystal_Hearts_Guide#Chapter_1)_\n\nThe crystal heart is located in the second sub-chapter, Crossing.\n\n### **Alternate Sides**\\[\\]\n\nThe B-Side includes three parts: [Start](https://celestegame.fandom.com/wiki/Start_(Forsaken_City_B-Side)), [Contraption](https://celestegame.fandom.com/wiki/Contraption), and [Scrap Pit](htt"
      },
      {
        "source_id": 3,
        "source_url": "https://www.ign.com/wikis/celeste/Chapter_1-_Forsaken_City",
        "content": ". It teaches you the basics of maneuvering and maintaining enough stamina, wile using the environment to the best of your ability. It also happens to be a dense level, packed with collectibles and secret rooms.\n\nBelow is a list of all 20 strawberries for this level, as well as the locations for the cassette tape and the Crystal Heart.\n\n## Start\n\n### Strawberry \\#1\n\nThe first strawberry is right out in the open on the second screen of the chapter. Use the spring to gain height and dash into the strawberry. Touch the ground to lock it in!\n\n### Strawberry \\#2\n\nOn the screen immediately after the first strawberry is the second! Drop down from the platform above the fruit to grab it and dash into the wall to recover. Climb and wall jump back up to safety!\n\n### Strawberry \\#3\n\nThis strawberry is the first flying strawberry you see. You cannot dash on this screen or you’ll scare it away. Use the platforms on the right to get above the flying fruit and drop down to collect it.\n\n### Strawberry"
      },
      {
        "source_id": 4,
        "source_url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3474899136",
        "content": "Celeste \n \n \n \n \n \n \n 101 ratings \n \n \n \n \n Chapter 1: Forsaken City - Complete Walkthrough [All Strawberries, Cassette Tape, and Crystal Heart] \n A GIF-guided walkthrough for collecting all strawberries, Cassette Tape, and Crystal Heart in 'Celeste - Chapter 1: Forsaken City' including video walkthrough and chapter map •⩊• \n \n \n \n \n \n Introduction \n \n ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ Hello ~ (・ω・)ﾉ This is a guide for all strawberries, Cassette Tape, and Crystal Heart in: 'Celeste: Chapter 1 - Forsaken City', Feel free to leave a comment, thumbs up, and check out my walkthrough video! - Abbilieve ♡ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ ⊹ .₊๋ ‧₊ ˚ ⊹ ࣭ ⭑ . ₊ \n \n \n \n \n Chapter Overview \n \n ‎ ‎ ‎ ‎"
      },
      {
        "source_id": 5,
        "source_url": "https://celestegame.fandom.com/wiki/Chapter_1:_Forsaken_City",
        "content": "kes\n- [Dash Crystals](https://celestegame.fandom.com/wiki/Dash_Crystals)\n- Smashable Walls\n- Springs\n- Disappearing Platforms\n- Traffic Light Blocks\n- [Falling Platforms](https://celestegame.fandom.com/wiki/Falling_Platforms)\n\n#### [Chasm](https://celestegame.fandom.com/wiki/Chasm)\\[\\]\n\nThe [B-Side Cassette Tape](https://celestegame.fandom.com/wiki/Cassette_Guide) for the chapter is located here.\n\n- Traffic Light Blocks\n- Spikes\n- Disappearing Platforms\n- Springs\n- [Cassette Blocks](https://celestegame.fandom.com/wiki/Cassette_Blocks)\n- Dash Crystals\n- Falling Platforms\n\n### **Crystal Heart**\\[\\]\n\n_Main article: [Crystal Hearts Guide](https://celestegame.fandom.com/wiki/Crystal_Hearts_Guide#Chapter_1)_\n\nThe crystal heart is located in the second sub-chapter, Crossing.\n\n### **Alternate Sides**\\[\\]\n\nThe B-Side includes three parts: [Start](https://celestegame.fandom.com/wiki/Start_(Forsaken_City_B-Side)), [Contraption](https://celestegame.fandom.com/wiki/Contraption), and [Scrap Pit](htt"
      },
      {
        "source_id": 6,
        "source_url": "https://www.neoseeker.com/celeste/walkthrough/Level_1_-_Forsaken_City",
        "content": ") There are 20 Strawberries hidden in the Forsaken City. There are six in the starting area, 9 in the middle section, called the Crossing, and 5 in the final section - the Chasm. You can find these strawberries by looking at the maps provided, or by watching the Strawberry video.\n\n* * *\n\n[![Celeste Cassette.png](https://cdn.staticneo.com/ew/c/cf/Celeste_Cassette.png)](https://www.neoseeker.com/celeste/File:Celeste_Cassette.png) The location of the B-Side Cassette is found near the beginning of the Chasm section - the final section of the Forsaken City\n\n* * *\n\n[![Celeste Crystal Heart.png](https://cdn.staticneo.com/ew/thumb/4/44/Celeste_Crystal_Heart.png/130px-Celeste_Crystal_Heart.png)](https://www.neoseeker.com/celeste/File:Celeste_Crystal_Heart.png) The Crystal Heart for this section is hidden near the Satellite in the second section. You have to watch the color pattern being broadcast over the satellite. There are birds flying around nearby, and they fly out in various directions. Y"
      },
      {
        "source_id": 7,
        "source_url": "https://www.switchaboo.com/celeste-100-strawberry-guide/",
        "content": "r way to the left and up to the next frame.\n\nTo get that strawberry, you’ll need to jump up, dash, and cling onto the side of the platform conveyor belt. But before making your way to that strawberry, there is ANOTHER hidden area that is revealed behind the conveyor platform that has this chapter’s B-Side Tape. For info on how to get that, we’ll have our guide up on B-Side Tapes very soon.\n\n![Celeste Strawberry 21](https://i1.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022718272500-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nNow, back to the strawberry! Jump, dash, and cling onto the conveyor platforform and jump off at the last second so that it flings you aaallllllll the way over to the other side.\n\n[iframe](https://www.youtube.com/embed/Pth-caAuurE?feature=oembed)\n\n### Strawberry \\#17\n\n![Celeste Strawberry 22](https://i0.wp.com/switchaboo.com/wp-content/uploads/2018/02/2018022718340400-75A32021BE3512D7AA96B2D72F764411.jpg?w=1280&ssl=1)\n\nNow jump down to the previous"
      },
      {
        "source_id": 8,
        "source_url": "https://www.trueachievements.com/game/Celeste/walkthrough/3",
        "content": "above you, get behind it and walk off screen to the left.\n\n[![PIC 4](https://www.trueachievements.com/customimages/l/110987.jpg)](https://www.trueachievements.com/customimages/110987.jpg)\n\n- Grab the **Hidden Tape**\n\n[Gateway](https://www.trueachievements.com/a246713/gateway-achievement)\n\nCollect a Cassette\n\n![Gateway](https://www.trueachievements.com/imagestore/l/0006945100/6945154.jpg)\n\n[2 guides](https://www.trueachievements.com/a246713/gateway-achievement?showguides=1)![Offline Mode - These achievements require play in game modes that do not necessitate a connection to any online services.](https://www.trueachievements.com/sprites/flags/offline-gamemode-lg.png)![Single Player - These achievements can be obtained by a single player.](https://www.trueachievements.com/sprites/flags/single-player-lg.png)![Collectable - These achievements are obtained by exploring the game environment to find a set of unique objects.](https://www.trueachievements.com/sprites/flags/collectable-lg.png)\n\n-"
      }
    ],
    "general": []
  }
}